[
 {
  "Movie": "12 Angry Men",
  "Language": "English",
  "Genre": "Drama",
  "Cast": "Henry Fonda, Lee J. Cobb, Joseph Sweeney, Martin Balsam, Ed Begley, John Savoca, Jack Klugman",
  "ReleaseDate": "1957-04-10",
  "Color": "BW",
  "Image": "12AngryMen",
  "Overview": "The film is renowned for its powerful portrayal of jury deliberations and the dynamics among jurors in a murder trial.<br><br>\nThe story unfolds primarily in a single room where twelve jurors deliberate the guilt or innocence of a young man accused of murdering his father. Initially, all but one juror are ready to deliver a quick guilty verdict, but Juror #8 (played by Henry Fonda) stands alone in his belief in the defendant's innocence. His insistence on examining the evidence and discussing the case thoroughly leads to intense and often heated debates among the jurors.<br><br>\nAs the deliberations progress, the jurors' personal biases, backgrounds, and prejudices gradually come to light, influencing their opinions and decisions. The film delves deep into themes of justice, reasonable doubt, empathy, and the responsibility of individuals in the legal system.<br><br>\n\"12 Angry Men\" is celebrated for its powerful performances, especially Henry Fonda's portrayal of Juror #8, who serves as the voice of reason and conscience in the room. The ensemble cast, which includes Lee J. Cobb, Ed Begley, E.G. Marshall, and Jack Klugman among others, delivers memorable performances that bring to life the tensions and complexities of the jury deliberation process.<br><br>\nThe film is notable for its minimalist setting and tight focus on character development and dialogue, creating a tense and gripping atmosphere throughout. \"12 Angry Men\" has since become a classic of American cinema, acclaimed for its insightful exploration of human nature and the principles of justice.<br><br>"
 },
 {
  "Movie": "13 Going On 30",
  "Language": "English",
  "Genre": "Romance",
  "Cast": "Jennifer Garner, Mark Ruffalo, Christa B. Allen, Judy Greer",
  "ReleaseDate": "2004-04-23",
  "Color": "Color",
  "Image": "13GoingOn30",
  "Overview": "The film revolves around Jenna Rink, a 13-year-old girl who makes a wish on her birthday to be 30 and suddenly wakes up the next day as a 30-year-old woman.<br><br>\nThe story begins in 1987 when Jenna, feeling awkward and unpopular at her 13th birthday party, wishes to be \"30, flirty, and thriving.\" Miraculously, her wish comes true, and she finds herself in 2004, living in a glamorous Manhattan apartment as a successful magazine editor. However, Jenna soon realizes that her adult life is not as perfect as she imagined. She reconnects with her childhood friend Matty (played by Mark Ruffalo), who is now a photographer, and discovers that their friendship has changed over the years.<br><br>\nAs Jenna navigates her newfound adulthood, she grapples with the consequences of the choices she made and learns valuable lessons about friendship, love, and self-acceptance. The film blends humor, nostalgia, and romance as Jenna tries to reconcile her 13-year-old self with her adult persona.<br><br>\n\"13 Going on 30\" received positive reviews for Jennifer Garner's charming performance and its nostalgic appeal, especially for those who grew up in the 1980s. The film's lighthearted tone and heartfelt moments have made it a beloved entry in the romantic comedy genre, appealing to audiences of all ages with its themes of second chances and the importance of staying true to oneself.<br><br>\n"
 },
 {
  "Movie": "6th Day, The",
  "Language": "English",
  "Genre": "Action",
  "Cast": "Arnold Schwarzenegger, Tony Goldwyn, Sarah Wynter, Taylor Anne Reid, Terry Crews, Michael Rooker",
  "ReleaseDate": "2000-11-13",
  "Color": "Color",
  "Image": "6thDay",
  "Overview": "The film is set in a near-future world where cloning technology has advanced to the point where human cloning is possible but strictly illegal.<br><br>\nThe story follows Adam Gibson (played by Schwarzenegger), a helicopter pilot who discovers that he has been illegally cloned after a botched mission. As he tries to uncover the truth behind his cloning and the conspiracy surrounding it, Gibson becomes embroiled in a dangerous web of corporate intrigue and ethical dilemmas.<br><br>\nIn this futuristic society, cloning has become a controversial issue with profound implications for identity, morality, and the sanctity of life. The film explores themes of scientific ethics, corporate greed, and the blurred lines between what is natural and what is artificial.<br><br>\nAs Gibson delves deeper into the mystery, he encounters other clones, confronts powerful figures who seek to control the technology for their own gain, and ultimately fights to reclaim his identity and protect his family.<br><br>\n\"The 6th Day\" blends action-packed sequences with philosophical questions about the consequences of cloning technology and the ethical implications of playing with human life. While it received mixed reviews from critics, the film remains notable for its exploration of futuristic themes and Schwarzenegger's typically charismatic performance in a sci-fi setting.<br><br>\n"
 },
 {
  "Movie": "8 Heads In A Duffel Bag",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "Joe Pesci, David Spade, Kristy Swanson, Andy Comeau, George Hamilton, Dyan Cannon",
  "ReleaseDate": "1997-04-18",
  "Color": "Color",
  "Image": "8HeadsInADuffelBag",
  "Overview": "The movie stars Joe Pesci as Tommy Spinelli, a mobster tasked with delivering a duffel bag containing the severed heads of eight mafia figures to his boss. However, things go awry when Tommy mistakenly picks up the wrong bag at the airport, which belongs to Charlie (played by Andy Comeau), a medical student on his way to meet his girlfriend's parents.<br><br>\nAs Tommy and Charlie's paths cross, the film unfolds with a series of comedic mishaps and misunderstandings as Charlie unknowingly carries around the gruesome contents of the duffel bag. Tommy desperately tries to retrieve the heads before his boss finds out about the mix-up, leading to absurd and increasingly chaotic situations.<br><br>\nThe film is known for its dark humor, slapstick comedy, and the contrast between the bumbling, innocent Charlie and the hardened criminal Tommy. As the mismatched duo navigates through their predicament, they encounter various eccentric characters and find themselves in increasingly absurd situations.<br><br>\n\"8 Heads in a Duffel Bag\" received mixed reviews upon its release but has since gained a cult following for its outrageous premise and comedic performances, particularly from Joe Pesci. The film's blend of crime thriller elements with dark comedy makes it a unique entry in the genre, offering a humorous take on the consequences of mistaken identity and criminal mishaps.<br><br>"
 },
 {
  "Movie": "Absent Minded Professor, The",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "Fred MacMurray, Nancy Olson, Tommy Kirk, Ed Wynn, Keenan Wynn, Elliott Reid",
  "ReleaseDate": "1961-03-16",
  "Color": "BW",
  "Image": "AbsentMindedProfessorThe",
  "Overview": "The film stars Fred MacMurray as Professor Ned Brainard, a brilliant but absent-minded scientist at Medfield College.<br><br>\nThe story revolves around Professor Brainard, who is so engrossed in his scientific experiments that he forgets about important events, including his own wedding to his fiancée, Betsy Carlisle (played by Nancy Olson). His latest experiment involves a substance called \"flubber\" (short for \"flying rubber\"), which gains remarkable properties that enable objects to defy gravity and bounce excessively.<br><br>\nAs Professor Brainard attempts to perfect his invention, he faces numerous humorous challenges and setbacks, including attempts by rival scientists to steal his formula. The film features slapstick comedy as well as heartfelt moments as Brainard tries to balance his passion for science with his personal life.<br><br>\nThe plot thickens when Brainard's discovery of flubber leads to a series of comedic and chaotic situations, including using it to help the Medfield College basketball team excel in their games. Ultimately, Brainard must reconcile his scientific achievements with his relationships and decide what truly matters in life.<br><br>\n\"The Absent-Minded Professor\" was well-received upon its release for its imaginative storyline, Fred MacMurray's endearing portrayal of the eccentric professor, and the film's innovative special effects showcasing the antics of flubber. The movie's success led to a sequel, \"Son of Flubber,\" and a 1997 remake titled \"Flubber,\" starring Robin Williams.<br><br>\n"
 },
 {
  "Movie": "Addicted to Love",
  "Language": "English",
  "Genre": "Romance",
  "Cast": "Meg Ryan, Matthew Broderick, Kelly Preston, Tchéky Karyo",
  "ReleaseDate": "1997-05-23",
  "Color": "Color",
  "Image": "AddictedToLove",
  "Overview": "The film revolves around the quirky and unconventional relationship that develops between two individuals who team up to exact revenge on their respective ex-partners.<br><br>\nThe story begins with Sam (played by Matthew Broderick) discovering that his longtime girlfriend, Linda (played by Kelly Preston), has left him for another man, a French chef named Anton (played by Tchéky Karyo). Devastated and heartbroken, Sam moves into an abandoned building across the street from Linda's apartment in New York City.<br><br>\nMeanwhile, Maggie (played by Meg Ryan), a tough and resourceful photographer, arrives in town seeking vengeance against her ex-boyfriend, Anton, who abandoned her without explanation. Maggie sets up surveillance equipment in Sam's building to spy on Anton and gather evidence of his infidelity.<br><br>\nInitially at odds with each other, Sam and Maggie form an unlikely alliance as they bond over their shared experiences of betrayal and heartache. Their plan to sabotage Anton and Linda's relationship leads to comedic and unexpected situations, blurring the lines between revenge and romance.<br><br>\n\"Addicted to Love\" explores themes of love, loss, and moving on from past relationships, while injecting humor and charm into its portrayal of two wounded souls finding solace and unexpected connection in each other's company. The film's blend of romantic comedy with elements of revenge and redemption has made it a memorable entry in the genre, buoyed by the chemistry between Meg Ryan and Matthew Broderick's characters.<br><br>"
 },
 {
  "Movie": "Adventures of Tintin, The",
  "Language": "English",
  "Genre": "Animated",
  "Cast": "Andy Serkis, Jamie Bell, Simon Pegg, Daniel Craig, Nick Frost",
  "ReleaseDate": "2011-10-26",
  "Color": "Color",
  "Image": "AdventuresOfTintin",
  "Overview": "\"The Adventures of Tintin\" is a 2011 animated action-adventure film directed by Steven Spielberg. It is based on the popular comic book series \"The Adventures of Tintin\" created by Belgian cartoonist Hergé. The film combines elements from three of Hergé's Tintin adventures: \"The Crab with the Golden Claws,\" \"The Secret of the Unicorn,\" and \"Red Rackham's Treasure.\"<br><br>\nThe story follows Tintin, a young and intrepid reporter with a knack for solving mysteries, voiced by Jamie Bell. Alongside his loyal dog Snowy, Tintin becomes embroiled in a thrilling quest when he purchases a model ship called the Unicorn. This purchase sets off a chain of events that lead Tintin into a globe-trotting adventure filled with danger, intrigue, and treasure hunting.<br><br>\nAs Tintin unravels the mystery surrounding the Unicorn, he encounters the irascible Captain Haddock, voiced by Andy Serkis, who holds crucial information about the lost treasure of his ancestor, Sir Francis Haddock. Together with Captain Haddock and the bumbling detectives Thomson and Thompson (voiced by Simon Pegg and Nick Frost), Tintin races against time to uncover the truth and outwit the sinister Ivan Sakharine (voiced by Daniel Craig), who also seeks the treasure.<br><br>\n\"The Adventures of Tintin\" is notable for its groundbreaking motion-capture animation technology, which brought Hergé's iconic characters and vibrant world to life with stunning visual fidelity. The film captures the spirit of the original comics with its fast-paced action sequences, intricate plot, and colorful characters, appealing both to fans of the comics and new audiences alike.<br><br>\nCritically acclaimed for its animation, storytelling, and faithfulness to the source material, \"The Adventures of Tintin\" received praise for its adventurous spirit and Spielberg's direction. It successfully revived interest in Tintin's adventures on the big screen and left audiences eager for potential sequels to further explore the beloved character's escapades.<br><br>"
 },
 {
  "Movie": "Aethiree",
  "Language": "Tamil",
  "Genre": "Comedy",
  "Cast": "R. Madhavan, Kaniha, Sadha, Vivek, ",
  "ReleaseDate": "2004-04-23",
  "Color": "Color",
  "Image": "Aethiree",
  "Overview": "Subramani poses as a goon to evict bachelor tenants from a Brahmin's house but ends up helping one of them to kidnap his lover from her marriage. He faces trouble when he kidnaps the wrong girl."
 },
 {
  "Movie": "Aladdin",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "Will Smith, Mena Massoud, Naomi Scott, Marwan Kenzari, Nasim Pedrad, Billy Magnussen",
  "ReleaseDate": "2019-05-24",
  "Color": "Color",
  "Image": "Aladdin",
  "Overview": "Directed by Guy Ritchie, the film brings the classic tale of \"Aladdin and the Magic Lamp\" to life with a mix of vibrant visuals, music, and new interpretations of familiar characters.<br><br>\nThe story follows Aladdin (played by Mena Massoud), a charming and resourceful street thief living in the fictional city of Agrabah. One day, Aladdin meets Princess Jasmine (played by Naomi Scott), who has disguised herself to experience life beyond the palace walls. They form a connection, but Aladdin's life changes when he is tasked by the villainous Grand Vizier Jafar (played by Marwan Kenzari) to retrieve a magical lamp from the Cave of Wonders.<br><br>\nInside the cave, Aladdin discovers the Genie (played by Will Smith), who grants him three wishes. With the Genie's help, Aladdin transforms into Prince Ali Ababwa to impress Jasmine and win her heart. However, Jafar's ambitions to usurp the Sultan's throne and control Agrabah threaten to disrupt Aladdin's newfound happiness.<br><br>\nThe 2019 adaptation of \"Aladdin\" stays faithful to the core elements of the original animated film while expanding on the characters' motivations and relationships. It features memorable musical numbers including classic songs like \"A Whole New World\" and introduces new compositions to enhance the story.<br><br>\nWill Smith's portrayal of the Genie, while distinct from Robin Williams' iconic performance in the animated version, brings humor, charisma, and a contemporary twist to the character. The film's visual effects and elaborate set designs immerse audiences in the colorful and enchanting world of Agrabah.<br><br>\n\"Aladdin\" (2019) received a mixed reception from critics but was generally praised for its entertaining spectacle, lively performances, and the nostalgic appeal of revisiting a beloved Disney classic. It achieved commercial success worldwide, appealing to both fans of the original animated film and new audiences looking for a magical and family-friendly adventure.<br><br>"
 },
 {
  "Movie": "Angoor",
  "Language": "Hindi",
  "Genre": "Comedy",
  "Cast": "Sanjeev Kumar, Moushumi Chatterjee, Deven Verma, Deepti Naval, Aruna Irani, Utpal Dutt, Padma Chavan",
  "ReleaseDate": "1982-03-05",
  "Color": "Color",
  "Image": "Angoor",
  "Overview": "\"Angoor\" is a classic Indian comedy film released in 1982, directed by Gulzar and based on William Shakespeare's play \"The Comedy of Errors.\" The film stars Sanjeev Kumar and Deven Verma in dual roles, along with Moushumi Chatterjee and Deepti Naval in key roles.<br><br>\nThe story revolves around two pairs of identical twins who are separated at birth due to a twist of fate. One pair consists of Ashok (Sanjeev Kumar) and Bahadur (Deven Verma), while the other pair consists of Anokhelal (Sanjeev Kumar) and Bhairav (Deven Verma). Coincidentally, they all end up in different places but share identical names and appearances.<br><br>\nThe plot takes off when Ashok and Bahadur, living in one city, encounter Anokhelal and Bhairav, who have arrived from another city. Hilarity ensues as misunderstandings and confusion arise due to their identical appearances and names. The film explores the comedic situations that arise from mistaken identities, mistaken intentions, and the chaos that ensues when characters interact with each other without realizing they are speaking to the wrong person.<br><br>\n\"Angoor\" is celebrated for its witty dialogue, clever humor, and excellent performances by the cast, particularly Sanjeev Kumar and Deven Verma, who skillfully handle their dual roles. Gulzar's direction and adaptation of Shakespeare's play into a comedic Indian context were also widely appreciated.<br><br>\nThe film has become a cult classic in Indian cinema, known for its timeless humor and memorable scenes. It remains a beloved comedy that continues to entertain audiences with its delightful blend of mistaken identities and comic situations."
 },
 {
  "Movie": "Animal, The",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "Rob Schneider, Colleen Haskell, John C. McGinley",
  "ReleaseDate": "2001-06-01",
  "Color": "Color",
  "Image": "AnimalThe",
  "Overview": "The film follows the story of Marvin Mange, a hapless and somewhat socially awkward police evidence file clerk who dreams of becoming a real police officer.<br><br>\nThe plot takes a fantastical turn when Marvin is critically injured in a car accident while trying to respond to a burglary. He is saved by a mad scientist who uses experimental animal organs to rebuild Marvin's body, effectively turning him into a human-animal hybrid with enhanced physical abilities. Marvin soon discovers that he has acquired the traits and instincts of various animals, leading to a series of comedic and often absurd situations as he tries to navigate his new abilities and responsibilities.<br><br>\nAs Marvin begins to utilize his newfound powers to fight crime and impress his colleagues, he also faces challenges in balancing his personal life and relationships. The film explores themes of identity, acceptance, and the consequences of tampering with nature in a lighthearted and comedic manner.<br><br>\nCritically, \"The Animal\" received mixed reviews. While some appreciated Rob Schneider's comedic performance and the film's slapstick humor, others found the premise and execution to be too outlandish and predictable. The film's humor often relies on physical comedy and Schneider's trademark comedic style, appealing primarily to fans of his work and those seeking light entertainment.<br><br>\nOverall, \"The Animal\" is viewed as a typical entry in Rob Schneider's filmography, offering a blend of silly humor and exaggerated situations that may appeal to audiences looking for escapist comedy. However, it is not considered a standout in the genre or remembered for its profound storytelling or character development.<br><br>"
 },
 {
  "Movie": "Asterix - Mansion of the Gods",
  "Language": "English",
  "Genre": "Animated",
  "Cast": "Roger Carel, Lorànt Deutsch, Laurent Lafitte, Guillaume Briat",
  "ReleaseDate": "2014-11-26",
  "Color": "Color",
  "Image": "MansionOfTheGods",
  "Overview": "The story is set in ancient Gaul, where the indomitable Gauls, led by Asterix and his friend Obelix, resist Roman occupation. Julius Caesar devises a new plan to defeat the Gauls by building a luxury Roman estate called \"The Mansion of the Gods\" near their village. The Romans hope to entice the Gauls with Roman comforts and lure them into Roman ways, thus undermining their resistance.<br><br>\nHowever, Asterix and Obelix are determined to thwart Caesar's plan and preserve their Gaulish way of life. They devise clever schemes and use their wit and strength to resist the allure of Romanization and protect their village from Caesar's influence.<br><br>\nThe film explores themes of cultural identity, resistance against oppression, and the clash of civilizations, all presented in a humorous and family-friendly manner typical of the Asterix comic series. The animation style stays true to the original comic's artwork, capturing its colorful characters and vibrant world.<br><br>\n\"Mansion of the Gods\" received positive reviews for its fidelity to the source material, witty humor, and engaging storyline. It was praised for its clever satire on modern consumerism and cultural imperialism, while also delivering entertaining action sequences and memorable characters.<br><br>\nOverall, \"Mansion of the Gods\" is celebrated as a successful adaptation of the beloved Asterix comics, appealing to both longtime fans and new audiences with its blend of adventure, humor, and social commentary.<br><br>"
 },
 {
  "Movie": "Avatar",
  "Language": "English",
  "Genre": "Action",
  "Cast": "Zoe Saldana, Sam Worthington, Sigourney Weaver, Michelle Rodriguez, Joel David Moore",
  "ReleaseDate": "2009-12-18",
  "Color": "Color",
  "Image": "Avatar",
  "Overview": "\"Avatar\" is a 2009 epic science fiction film directed and produced by James Cameron. It stands out for its groundbreaking visual effects, particularly its use of 3D technology and motion capture to create a visually stunning world and creatures.<br><br>\nThe story is set in the mid-22nd century on the lush, inhabited moon of Pandora, which orbits a gas giant in the Alpha Centauri star system. The protagonist, Jake Sully (played by Sam Worthington), is a paralyzed former Marine who is recruited to take part in the Avatar Program, a project that allows humans to remotely control genetically engineered Na'vi bodies to interact with the native population.<br><br>\nAs Jake becomes immersed in the culture of the Na'vi, he forms a deep connection with Neytiri (played by Zoe Saldana), a Na'vi princess. However, tensions rise as the human mining corporation led by Colonel Miles Quaritch (played by Stephen Lang) threatens Pandora's indigenous population in their quest for valuable resources.<br><br>\nThe film explores themes of environmentalism, colonialism, and the clash between nature and technology. It delves into the ethical implications of exploiting resources and displacing indigenous cultures for profit, while also celebrating the interconnectedness of all living beings.<br><br>\n\"Avatar\" received widespread critical acclaim for its visual effects, world-building, and immersive 3D experience. It became a cultural phenomenon and broke numerous box office records, becoming the highest-grossing film of all time (until it was surpassed by \"Avengers: Endgame\" in 2019).<br><br>\nThe success of \"Avatar\" led to plans for multiple sequels, with James Cameron aiming to further explore Pandora's world and its inhabitants. The film's impact on filmmaking technology and its influence on popular culture cemented its place as a landmark achievement in the history of cinema.<br><br>"
 },
 {
  "Movie": "Avvai Shanmugi",
  "Language": "Tamil",
  "Genre": "Comedy",
  "Cast": "Kamal Haasan, Meena, Gemini Ganesan, K. S. Ravikumar, Heera Rajagopal, Nassar, Crazy Mohan",
  "ReleaseDate": "1996-11-10",
  "Color": "Color",
  "Image": "AvvaiShanmugi",
  "Overview": "The plot of \"Avvai Shanmugi\" revolves around Pandyan (played by Kamal Haasan), a loving father who goes through a bitter divorce with his wife. To gain custody of his daughter, Pandyan disguises himself as Avvai Shanmugi, an elderly woman hired to care for his daughter. Avvai Shanmugi is portrayed with humor and warmth as she navigates the complexities of domestic life while concealing her true identity.<br><br>\nAs Avvai Shanmugi, Pandyan faces numerous comedic challenges and cultural adjustments. The film explores themes of family, love, and the lengths a parent will go to for their child's happiness. The narrative unfolds with entertaining situations and misunderstandings arising from Pandyan's dual identity.<br><br>\nKamal Haasan's performance in the titular role of Avvai Shanmugi garnered critical acclaim for his portrayal of both the sensitive father and the humorous elderly woman. The film's success was also attributed to its engaging storyline, lively music composed by Deva, and the chemistry between the cast members.<br><br>\n\"Avvai Shanmugi\" was a box office hit and remains a beloved comedy classic in Tamil cinema. It is celebrated for its light-hearted humor, memorable dialogues, and its commentary on social issues through the lens of comedy. The film's success led to it being remade in several languages, showcasing its enduring popularity and influence in Indian cinema.<br><br>"
 },
 {
  "Movie": "Baankey Ki Crazy Baraat",
  "Language": "Hindi",
  "Genre": "Comedy",
  "Cast": "Rajpal Yadav, Vijay Raaz, Sanjay Mishra, Satyajeet Dubey, Tia Bajpai, Rakesh Bedi",
  "ReleaseDate": "2015-08-28",
  "Color": "Color",
  "Image": "BaankeyKiCrazyBaraat",
  "Overview": "The plot revolves around Baankey (played by Rajpal Yadav), a simple and innocent man who gets embroiled in a series of chaotic events surrounding a wedding. Baankey becomes inadvertently involved in a \"crazy baraat\" (wedding procession) where unexpected and hilarious situations unfold due to misunderstandings, mistaken identities, and quirky characters.<br><br>\nAs Baankey navigates through the chaotic wedding preparations and ceremonies, he encounters eccentric relatives, nosy neighbors, and a range of mishaps that threaten to derail the wedding festivities. The film blends slapstick comedy with situational humor as Baankey and the ensemble cast find themselves in increasingly absurd and humorous predicaments.<br><br>\n\"Baankey Ki Crazy Baraat\" is known for its light-hearted and entertaining portrayal of Indian wedding culture, emphasizing the colorful and eventful nature of traditional celebrations. The film's ensemble cast delivers spirited performances, with Rajpal Yadav's comedic timing and Sanjay Mishra's eccentric character adding to the film's comedic appeal.<br><br>\nWhile the film received mixed reviews from critics, it found an audience among fans of Hindi comedy films for its energetic performances, humorous storyline, and lively music. \"Baankey Ki Crazy Baraat\" remains a popular choice for audiences looking for a fun-filled and light-hearted comedy experience centered around the chaos of weddings in Indian culture.<br><br>"
 },
 {
  "Movie": "Baby's Day Out",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "Jacob Joseph Worton, Adam Robert Worton, Joe Mantegna, Joe Pantoliano, Brian Haley, Lara Flynn Boyle, Cynthia Nixon",
  "ReleaseDate": "1994-07-01",
  "Color": "Color",
  "Image": "BabysDayOut",
  "Overview": "The film stars Joe Mantegna, Lara Flynn Boyle, Joe Pantoliano, and Brian Haley, with twins Adam and Jacob Worton playing the role of Baby Bink.<br><br>\nThe story revolves around Baby Bink, the wealthy infant son of a wealthy couple in Chicago. He becomes the target of three bumbling criminals: Eddie (played by Joe Mantegna), Norby (played by Joe Pantoliano), and Veeko (played by Brian Haley). The criminals kidnap Baby Bink with the intention of holding him for ransom, hoping to score a large sum of money from his wealthy parents.<br><br>\nHowever, Baby Bink manages to escape from the criminals' clutches and embarks on an adventure through the streets of Chicago. The film humorously depicts Baby Bink's journey as he navigates various obstacles and encounters, unaware of the danger he's in. Throughout his escapade, Baby Bink's innocent curiosity leads him to unwittingly outwit the criminals at every turn.<br><br>\nAs Baby Bink's parents, the police, and the criminals all scramble to find him, the film unfolds with slapstick comedy and humorous situations. It celebrates the resilience and cleverness of the baby, contrasting sharply with the incompetence of the criminals.<br><br>\n\"Baby's Day Out\" received mixed reviews from critics but found success with audiences, particularly for its charming portrayal of a baby's escapades and the comedic performances of the cast. The film's blend of adventure and humor, combined with its adorable central character, has made it a nostalgic favorite for many viewers who enjoy family-friendly comedies.<br><br>"
 },
 {
  "Movie": "Bachna Ae Haseeno",
  "Language": "Hindi",
  "Genre": "Romance",
  "Cast": "Ranbir Kapoor, Bipasha Basu, Minissha Lamba, Deepika Padukone, Kunal Kapoor",
  "ReleaseDate": "2008-08-15",
  "Color": "Color",
  "Image": "BachnaAeHaseeno",
  "Overview": "The story revolves around Raj Sharma (played by Ranbir Kapoor), a carefree and charming young man who believes in living life to the fullest without commitment. He meets and dates three different women at different stages of his life: Mahi (played by Minissha Lamba), Radhika (played by Bipasha Basu), and Gayatri (played by Deepika Padukone).<br><br>\nAs Raj's relationships with these women unfold, the film explores themes of love, heartbreak, and personal growth. Each relationship teaches Raj valuable lessons about life and love, transforming him from a carefree flirt into a more mature and understanding individual.<br><br>\nThe title \"Bachna Ae Haseeno\" translates to \"Beware, oh beauties\" in English, reflecting Raj's journey of reckoning with his past behavior and learning to value and respect the women in his life. The film's narrative structure moves between past and present, showcasing Raj's evolution as he reflects on his relationships and their impact on his life.<br><br>\n\"Bachna Ae Haseeno\" was well-received for its engaging storyline, catchy music composed by Vishal-Shekhar, and the charismatic performances of its cast, particularly Ranbir Kapoor. The film's exploration of love and relationships resonated with audiences, making it a commercial success at the box office.<br><br>\nOverall, \"Bachna Ae Haseeno\" is remembered as a contemporary romantic drama that blends humor, romance, and emotional depth, offering insights into the complexities of modern relationships and personal growth.<br><br>"
 },
 {
  "Movie": "Back to the Future 1",
  "Language": "English",
  "Genre": "Action",
  "Cast": "Michael J. Fox, Christopher Lloyd, Lea Thompson, Crispin Glover, Thomas F. Wilson",
  "ReleaseDate": "1985-07-03",
  "Color": "Color",
  "Image": "BackToTheFuture1",
  "Overview": "The story follows Marty McFly, a high school student who accidentally travels back in time to 1955 in a plutonium-powered DeLorean time machine invented by Doc Brown. In 1955, Marty encounters a younger version of his parents and inadvertently interferes with their budding romance, endangering his own existence. With the help of the younger Doc Brown, Marty must find a way to ensure his parents fall in love while repairing the damaged time machine to return to 1985.<br><br>\n\"Back to the Future\" blends elements of science fiction, comedy, and adventure, creating a timeless and iconic film that appeals to audiences of all ages. The film's exploration of time travel paradoxes, as Marty navigates the challenges of altering the past while preserving his future, is complemented by its witty dialogue and memorable characters.<br><br>\nThe film's success led to two sequels, \"Back to the Future Part II\" (1989) and \"Back to the Future Part III\" (1990), forming a trilogy that further explores Marty and Doc Brown's adventures across different time periods. The trilogy remains a cultural phenomenon, celebrated for its imaginative storytelling, innovative special effects, and enduring appeal.<br><br>\n\"Back to the Future\" received critical acclaim for its screenplay, direction, performances, and Alan Silvestri's iconic musical score. It has since become a beloved classic, influencing popular culture and inspiring numerous adaptations, merchandise, and references in other films and TV shows.<br><br>\nOverall, \"Back to the Future\" is regarded as one of the greatest films of the 1980s, known for its entertainment value, creative premise, and timeless themes of friendship, courage, and the consequences of altering history.<br><br>\n"
 },
 {
  "Movie": "Back to the Future 2",
  "Language": "English",
  "Genre": "Action",
  "Cast": "Michael J. Fox, Christopher Lloyd, Lea Thompson",
  "ReleaseDate": "1989-03-22",
  "Color": "Color",
  "Image": "BackToTheFuture2",
  "Overview": "The story picks up immediately after the events of the first film, with Marty and Doc traveling from 1985 to the future—specifically, to October 21, 2015—to prevent a series of events that would negatively impact the future of Marty's family. In the future, Marty must prevent his son from being involved in a robbery orchestrated by Biff Tannen's grandson, Griff. Along the way, Marty purchases a sports almanac, which he later discovers will have catastrophic consequences if it falls into the wrong hands.<br><br>\nAfter successfully thwarting the robbery, Marty accidentally interferes with events in 1955, creating an alternate timeline where Biff (now an elderly man) has used the sports almanac to become incredibly wealthy and powerful. Marty and Doc must now travel back to 1955 once again to retrieve the almanac and restore the original timeline, all while facing new challenges and encountering their younger selves from the first film.<br><br>\n\"Back to the Future Part II\" is notable for its complex narrative involving multiple timelines, parallel events, and the consequences of altering history. The film showcases impressive visual effects for its time, including the depiction of a futuristic 2015 and the seamless integration of actors playing multiple roles.<br><br>\nThe sequel was well-received for its imaginative storytelling, humor, and action sequences, though its darker tone and more intricate plot were noted compared to the original. It successfully sets up the third and final installment of the trilogy, \"Back to the Future Part III\" (1990), which concludes Marty and Doc's time-traveling adventures.<br><br>\nOverall, \"Back to the Future Part II\" remains a beloved continuation of the franchise, expanding on the themes of time travel, friendship, and the consequences of altering the past. It is considered a classic of 1980s cinema and a crucial part of the \"Back to the Future\" trilogy's enduring legacy.<br><br>\n"
 },
 {
  "Movie": "Back to the Future 3",
  "Language": "English",
  "Genre": "Action",
  "Cast": "Michael J. Fox, Christopher Lloyd, Mary Steenburgen, Thomas F. Wilson, Lea Thompson",
  "ReleaseDate": "1990-05-25",
  "Color": "Color",
  "Image": "BackToTheFuture3",
  "Overview": "The story continues directly from the cliffhanger ending of \"Back to the Future Part II,\" where Marty receives a letter from Doc dated 1885, revealing that he is alive and living in the Old West. Marty discovers that Doc is trapped in the year 1885 after the DeLorean time machine was struck by lightning and sent back in time. Determined to rescue his friend, Marty travels back to 1885 using the repaired DeLorean.<br><br>\nIn the Old West, Marty reunites with Doc, who has integrated himself into the town of Hill Valley and fallen in love with schoolteacher Clara Clayton (played by Mary Steenburgen). However, their plans to return to 1985 are complicated by the discovery that the DeLorean lacks the necessary fuel for time travel. Marty and Doc must find a way to generate the 1.21 gigawatts of electricity needed to power the DeLorean and overcome various obstacles, including encounters with Buford \"Mad Dog\" Tannen (played by Thomas F. Wilson), the notorious outlaw ancestor of Biff Tannen.<br><br>\n\"Back to the Future Part III\" blends elements of western film genre with the time-traveling adventure that defines the series. It explores themes of friendship, courage, and the importance of personal growth, as Marty and Doc confront challenges in the Wild West while trying to preserve the timeline and return to their own time.<br><br>\nThe film received positive reviews for its entertaining blend of action, humor, and heartfelt moments, marking a return to the lighter tone of the first film compared to the more complex narrative of the second installment. It successfully concludes the trilogy with satisfying resolutions for its characters and themes, solidifying its place as a beloved classic in cinema history.<br><br>\nOverall, \"Back to the Future Part III\" is celebrated for its imaginative storytelling, impressive performances, and the enduring chemistry between Michael J. Fox and Christopher Lloyd. It remains a favorite among fans of the series and continues to entertain audiences with its timeless appeal.<br><br>\n"
 },
 {
  "Movie": "Bean",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "Rowan Atkinson, Peter MacNicol, Pamela Reed, Harris Yulin, Burt Reynolds",
  "ReleaseDate": "1997-08-01",
  "Color": "Color",
  "Image": "Bean",
  "Overview": "Childlike Englishman, Mr. Bean, is an incompetent watchman at the Royal National Gallery. After the museum's board of directors' attempt to have him fired is blocked by the chairman, who has taken a liking to Bean, they send him to Los Angeles to act as their ambassador for the unveiling of a historic painting to humiliate him. Fooled, Mr. Bean must now successfully unveil the painting or risk his and a hapless Los Angeles curator's termination."
 },
 {
  "Movie": "Bean's Holiday, Mr",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "Rowan Atkinson, Emma de Caunes, Willem Dafoe",
  "ReleaseDate": "2007-03-24",
  "Color": "Color",
  "Image": "BeansHoliday",
  "Overview": "Mr. Bean wins a trip to Cannes where he unwittingly separates a young boy from his father and must help the two reunite. On the way he discovers France, bicycling and true love, among other things."
 },
 {
  "Movie": "Bee Movie",
  "Language": "English",
  "Genre": "Animated",
  "Cast": "Jerry Seinfeld, Renée Zellweger, Matthew Broderick, John Goodman, Patrick Warburton, Chris Rock",
  "ReleaseDate": "2007-11-02",
  "Color": "Color",
  "Image": "BeeMovie",
  "Overview": "Barry B Benson, a bee who has just completed his graduation, decides to sue humans after he learns about the exploitation of bees at the hands of mankind."
 },
 {
  "Movie": "Beverly Hills Cop",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "Eddie Murphy, Judge Reinhold, John Ashton, Lisa Eilbacher, Ronny Cox, Steven Berkoff",
  "ReleaseDate": "1984-12-05",
  "Color": "Color",
  "Image": "BeverlyHillsCop",
  "Overview": "The heat is on in this fast paced action-comedy starring Eddie Murphy as Axel Foley, a street smart Detroit cop tracking down his best friend's killer in Beverly Hills. Axel quickly learns that his wild style doesn't fit in with the Beverly Hills Police Department, which assigns two officers to make sure things don't get out of hand. Dragging the stuffy detectives along for the ride, Axel smashes through a huge culture clash in his hilarious, high-speed pursuit of justice. Featuring cameos by Paul Reiser, Bronson Pinchot and Damon Wayans, Beverly Hills Cop is an exhilarating, sidesplitting adventure."
 },
 {
  "Movie": "Bhagam Bhag",
  "Language": "Hindi",
  "Genre": "Comedy",
  "Cast": "Akshay Kumar, Govinda, Paresh Rawal, Jackie Shroff, Arbaaz Khan, Lara Dutta, Rajpal Yadav, Manoj Joshi, Shakti Kapoor, Asrani, Sharat Saxena, Tanushree Dutta, Razak Khan",
  "ReleaseDate": "2006-12-22",
  "Color": "Color",
  "Image": "BhagamBhag",
  "Overview": "Champak Chaturvedi runs a theatrical troupe in India. He hires two men, Bunty - a graduate in Arts, and Babla- who cannot read nor write English. One has to play the role of the play's hero, while one the villain. Both men end up squabbling with each other, as both want the hero's part. Then Champak finds out that Bunty has molested the play's heroine, Anjali, and punishes him. The group gets a contract to stage 30 plays in Britain, however, on the day of the departure, Anjali opts out, leaving Champak no alternative but to travel without a heroine, but hoping to recruit one while in Britain. Upon arrival, Babla sets about to find a suitable heroine from the Indian population, but Bunty beats him to it and recruits a woman named Munni.\n\n"
 },
 {
  "Movie": "Bheja Fry",
  "Language": "Hindi",
  "Genre": "Comedy",
  "Cast": "Vinay Pathak, Rajat Kapoor, Sarika, Ranvir Shorey, Milind Soman",
  "ReleaseDate": "2007-04-13",
  "Color": "Color",
  "Image": "BhejaFry",
  "Overview": "Ranjeet Thadani (Rajat Kapoor), a bored, arrogant music company executive hurts his back the night he has found a prize catch for a weekly bring - your -idiot talent dinner hosted by his friends and him. He ends up spending the evening with this idiot, Bharat Bhushan (Vinay Pathak) who tries to help him get his wife (Sarika) back who left him earlier that day. The result is utter chaos let loose by the idiot, who cannot do a single thing without messing it up further. The plot turns around to be a series of mini disasters that leave Ranjeet's comfortable life in ruins. Call it the idiot's revenge!"
 },
 {
  "Movie": "Bheja Fry 2",
  "Language": "Hindi",
  "Genre": "Comedy",
  "Cast": "Vinay Pathak, Kay Kay Menon, Rukhsaar Rehman, Minisha Lamba, Suresh Menon, Amol Gupte, Kishwer Merchant",
  "ReleaseDate": "2011-06-17",
  "Color": "Color",
  "Image": "BhejaFry2",
  "Overview": "Bhushan, a tax inspector, wins a ticket to a cruise-liner. Relaxing there, he meets Ajit, a businessman who is evading an IT raid. They end up on an isolated island that leads to comical situations."
 },
 {
  "Movie": "Billu Barber",
  "Language": "Hindi",
  "Genre": "Drama",
  "Cast": "Irrfan Khan, Shah Rukh Khan, Lara Dutta",
  "ReleaseDate": "2009-02-13",
  "Color": "Color",
  "Image": "BilluBarber",
  "Overview": "When a famous Bollywood actor visits a small village for a film's shoot, a lowly hairdressers claim that they were once childhood friends soon makes him the centre of attention."
 },
 {
  "Movie": "Blackbeard's Ghost",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "Peter Ustinov, Dean Jones, Suzanne Pleshette",
  "ReleaseDate": "1968-02-08",
  "Color": "Color",
  "Image": "BlackbeardsGhost",
  "Overview": "The eponymous wraith returns to Earth to aid his descendant, elderly Emily Stowecroft. The villains want to kick Emily and her friends out of their group home so that they can build a crooked casino. Good guy Steve Walker gets caught in the middle of the squabble after evoking Blackbeard's ghost."
 },
 {
  "Movie": "Blended",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "Adam Sandler, Drew Barrymore, Kevin Nealon, Terry Crews, Wendi McLendon-Covey",
  "ReleaseDate": "2014-05-30",
  "Color": "Color",
  "Image": "blended",
  "Overview": "Recently divorced mom Lauren and widowed dad Jim let their friends push them into a blind date, which goes disastrously wrong. Unsurprisingly, neither wants to see the other ever again. However, fate intervenes when both Jim and Lauren, unbeknown to each other, purchase one-half of the same vacation package at a South African resort for families. They and their children are forced to share the same suite and participate in a slew of family activities together, where their attractions grows as their respective kids benefit from the burgeoning relationship."
 },
 {
  "Movie": "Blue Streak",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "Martin Lawrence, Luke Wilson, Dave Chappelle, Peter Greene, Nicole Parker, William Forsythe",
  "ReleaseDate": "1999-09-17",
  "Color": "Color",
  "Image": "BlueStreak",
  "Overview": "Miles Logan is a jewel thief who just hit the big time by stealing a huge diamond. However, after two years in jail, he comes to find out that he hid the diamond in a police building that was being built at the time of the robbery. In an attempt to regain his diamond, he poses as an LAPD detective."
 },
 {
  "Movie": "Bolt",
  "Language": "English",
  "Genre": "Animated",
  "Cast": "John Travolta, Miley Cyrus, Susie Essman, Mark Walton, Malcolm McDowell, James Lipton, Greg Germann",
  "ReleaseDate": "2008-11-21",
  "Color": "Color",
  "Image": "Bolt",
  "Overview": "Bolt is the star of the biggest show in Hollywood. The only problem is, he thinks it's real. After he's accidentally shipped to New York City and separated from Penny, his beloved co-star and owner, Bolt must harness all his \"super powers\" to find a way home."
 },
 {
  "Movie": "Bourne Identity, The",
  "Language": "English",
  "Genre": "Action",
  "Cast": "Matt Damon, Franka Potente, Chris Cooper, Clive Owen, Brian Cox, Adewale Akinnuoye-Agbaje",
  "ReleaseDate": "2002-06-06",
  "Color": "Color",
  "Image": "BourneIdentity",
  "Overview": "Wounded to the brink of death and suffering from amnesia, Jason Bourne is rescued at sea by a fisherman. With nothing to go on but a Swiss bank account number, he starts to reconstruct his life, but finds that many people he encounters want him dead. However, Bourne realizes that he has the combat and mental skills of a world-class spy—but who does he work for?"
 },
 {
  "Movie": "Bourne Supremacy, The",
  "Language": "English",
  "Genre": "Action",
  "Cast": "Matt Damon, Franka Potente, Brian Cox, Julia Stiles, Karl Urban, Gabriel Mann, Joan Allen",
  "ReleaseDate": "2004-07-23",
  "Color": "Color",
  "Image": "BourneSupremacy",
  "Overview": "When a CIA operation to purchase classified Russian documents is blown by a rival agent, who then shows up in the sleepy seaside village where Bourne and Marie have been living. The pair run for their lives and Bourne, who promised retaliation should anyone from his former life attempt contact, is forced to once again take up his life as a trained assassin to survive."
 },
 {
  "Movie": "Bourne Ultimatum",
  "Language": "English",
  "Genre": "Action",
  "Cast": "Matt Damon, Julia Stiles, David Strathairn, Scott Glenn, Paddy Considine, Édgar Ramírez, Albert Finney, Joan Allen",
  "ReleaseDate": "2007-08-03",
  "Color": "Color",
  "Image": "BourneUltimatum",
  "Overview": "Bourne is brought out of hiding once again by reporter Simon Ross who is trying to unveil Operation Blackbriar, an upgrade to Project Treadstone, in a series of newspaper columns. Information from the reporter stirs a new set of memories, and Bourne must finally uncover his dark past while dodging The Company's best efforts to eradicate him."
 },
 {
  "Movie": "Brewster's Millions",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "Richard Pryor, John Candy, Lonette McKee, Stephen Collins, Hume Cronyn",
  "ReleaseDate": "1985-05-22",
  "Color": "Color",
  "Image": "BrewstersMillions",
  "Overview": "Brewster, an aging minor-league baseball player, stands to inherit 300 million dollars if he can successfully spend 30 million dollars in 30 days without anything to show for it, and without telling anyone what he's up to... A task that's a lot harder than it sounds!"
 },
 {
  "Movie": "Bruce Almighty",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "Jim Carrey, Morgan Freeman, Jennifer Aniston, Philip Baker Hall",
  "ReleaseDate": "2003-05-23",
  "Color": "Color",
  "Image": "BruceAlmighty",
  "Overview": "Bruce Nolan toils as a 'human interest' television reporter in Buffalo, N.Y., but despite his high ratings and the love of his beautiful girlfriend, Bruce remains unfulfilled. At the end of the worst day in his life, he angrily ridicules God—and the Almighty responds, endowing Bruce with all of His divine powers."
 },
 {
  "Movie": "Bucket List, The",
  "Language": "English",
  "Genre": "Drama",
  "Cast": "Jack Nicholson, Morgan Freeman, Sean Hayes, Rob Morrow",
  "ReleaseDate": "2007-12-25",
  "Color": "Color",
  "Image": "BucketList",
  "Overview": "Corporate billionaire Edward Cole and working class mechanic Carter Chambers are worlds apart. At a crossroads in their lives, they share a hospital room and discover they have two things in common: a desire to spend the time they have left doing everything they ever wanted to do and an unrealized need to come to terms with who they are. Together they embark on the road trip of a lifetime, becoming friends along the way and learning to live life to the fullest, with insight and humor."
 },
 {
  "Movie": "Buddha Mar Gaya",
  "Language": "Hindi",
  "Genre": "Comedy",
  "Cast": "Anupam Kher, Om Puri, Paresh Rawal, Rakhi Sawant",
  "ReleaseDate": "2007-08-17",
  "Color": "Color",
  "Image": "BuddhaMarGaya",
  "Overview": "Laxmikant Kabadiya and his twin sister, Prerna, have made it to the top from the very bottom, and now -- as they are about to land their greatest windfall of all -- an untimely and messy family death spoils their plans."
 },
 {
  "Movie": "Cars",
  "Language": "English",
  "Genre": "Animated",
  "Cast": "Owen Wilson, Paul Newman",
  "ReleaseDate": "2006-08-04",
  "Color": "Color",
  "Image": "Cars",
  "Overview": "Lightning McQueen, a hotshot rookie race car driven to succeed, discovers that life is about the journey, not the finish line, when he finds himself unexpectedly detoured in the sleepy Route 66 town of Radiator Springs. On route across the country to the big Piston Cup Championship in California to compete against two seasoned pros, McQueen gets to know the town's offbeat characters."
 },
 {
  "Movie": "Chalo Dilli",
  "Language": "Hindi",
  "Genre": "Comedy",
  "Cast": "Lara Dutta, Vinay Pathak, Akshay Kumar, Mahika Sharma",
  "ReleaseDate": "2011-04-29",
  "Color": "Color",
  "Image": "ChaloDilli",
  "Overview": "Lara Dutta accompanied by Vinay Pathak rediscover the colors of India in their journey to Delhi."
 },
 {
  "Movie": "Chalti Ka Naam Gaadi",
  "Language": "Hindi",
  "Genre": "Comedy",
  "Cast": "Ashok Kumar, Madhubala, Anoop Kumar, Kishore Kumar",
  "ReleaseDate": "1958-01-01",
  "Color": "BW",
  "Image": "ChaltiKaNaamGaadi",
  "Overview": "Brijmohan believes that his love, Kamini, left him for another man and resents women. When his two brothers, who had planned for lifelong bachelorhood, fall in love, they fear his wrath."
 },
 {
  "Movie": "CID",
  "Language": "Hindi",
  "Genre": "Drama",
  "Cast": "Dev Anand, Shakila, Waheeda Rehman",
  "ReleaseDate": "1956-01-01",
  "Color": "BW",
  "Image": "CID",
  "Overview": "A newspaper editor, Shrivastav, is killed when he was about to expose the underworld links of a very rich and influential person. C.I.D. Inspector Shekhar is assigned to this case, an investigation of which leads him to suspect Dharamdas and his men. But Dharamdas spins a web of lies and deceit, and Shekhar himself becomes a suspect, and is arrested by the police, and loses his job, leaving Dharamdas and his men to carry on undeterred."
 },
 {
  "Movie": "Cloudy with a Chance of Meatballs",
  "Language": "English",
  "Genre": "Animated",
  "Cast": "Bill Hader, Anna Faris, James Caan, Andy Samberg, Bruce Campbell, Mr. T",
  "ReleaseDate": "2009-09-18",
  "Color": "Color",
  "Image": "CloudywithaChanceofMeatballs",
  "Overview": "Inventor Flint Lockwood creates a machine that makes clouds rain food, enabling the down-and-out citizens of Chewandswallow to feed themselves. But when the falling food reaches gargantuan proportions, Flint must scramble to avert disaster. Can he regain control of the machine and put an end to the wild weather before the town is destroyed?"
 },
 {
  "Movie": "Coco",
  "Language": "English",
  "Genre": "Animated",
  "Cast": "Anthony Gonzalez, Gael García Bernal, Benjamin Bratt, Alanna Ubach, Renée Victor, Ana Ofelia Murguía, Edward James Olmos",
  "ReleaseDate": "2017-11-22",
  "Color": "Color",
  "Image": "Coco",
  "Overview": "Despite his family’s baffling generations-old ban on music, Miguel dreams of becoming an accomplished musician like his idol, Ernesto de la Cruz. Desperate to prove his talent, Miguel finds himself in the stunning and colorful Land of the Dead following a mysterious chain of events. Along the way, he meets charming trickster Hector, and together, they set off on an extraordinary journey to unlock the real story behind Miguel's family history."
 },
 {
  "Movie": "Come September",
  "Language": "English",
  "Genre": "Romance",
  "Cast": "Rock Hudson, Gina Lollobrigida, Sandra Dee, Joel Grey, Bobby Darin, Walter Slezak",
  "ReleaseDate": "1961-08-09",
  "Color": "Color",
  "Image": "ComeSeptember",
  "Overview": "Robert Talbot, an American millionaire, arrives early for his annual vacation at his luxurious Italian villa. His long-time girlfriend Lisa has given up waiting for him and has decided to marry another man. Meanwhile, his sneaky business associate Maurice secretly misappropriates the villa as a hotel while Talbot is away. The current guests of the \"hotel\" are a group of young American girls."
 },
 {
  "Movie": "Coming To America",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "Eddie Murphy, Arsenio Hall, James Earl Jones, John Amos, Madge Sinclair, Shari Headley",
  "ReleaseDate": "1988-06-26",
  "Color": "Color",
  "Image": "ComingToAmerica",
  "Overview": "An African prince decides it’s time for him to find a princess... and his mission leads him and his most loyal friend to Queens, New York. In disguise as an impoverished immigrant, the pampered prince quickly finds himself a new job, new friends, new digs, new enemies and lots of trouble."
 },
 {
  "Movie": "Conspiracy Theory",
  "Language": "English",
  "Genre": "Action",
  "Cast": "Mel Gibson, Julia Roberts, Patrick Stewart",
  "ReleaseDate": "1997-08-04",
  "Color": "Color",
  "Image": "ConspiracyTheory",
  "Overview": "A man obsessed with conspiracy theories becomes a target after one of his theories turns out to be true. Unfortunately, in order to save himself, he has to figure out which theory it is."
 },
 {
  "Movie": "Daddy Cool",
  "Language": "Hindi",
  "Genre": "Comedy",
  "Cast": "Sunil Shetty, Javed Jaffrey, Aftab Shivdasani, Aarti Chabria, Ashish Chaudhary, Kim Sharma, Sophie Choudry, Rajpal Yadav, Tulip Joshi, Chunky Pandey, Prem Chopra",
  "ReleaseDate": "2009-08-28",
  "Color": "Color",
  "Image": "DaddyCool",
  "Overview": "So, what can happen at a funeral? Even, if it's the funeral of Daddy Cool Douglas Lazarus? It's in Goa, tears, sad speeches, melancholia... right? Wrong! When... The coffin makers deliver the wrong body, all hell breaks loose in this witty comedy starring Sunil Shetty and many of B-Town's rich and famous as they try and find the body of their beloved."
 },
 {
  "Movie": "Dam Busters, The",
  "Language": "English",
  "Genre": "Action",
  "Cast": "Richard Todd, Michael Redgrave",
  "ReleaseDate": "1955-05-16",
  "Color": "BW",
  "Image": "DamBusters",
  "Overview": "The story of the conception of a new British weapon for smashing the German dams in the Ruhr industrial complex and the execution of the raid by 617 Squadron 'The Dam Busters'."
 },
 {
  "Movie": "Day of the Jackal, The",
  "Language": "English",
  "Genre": "Action",
  "Cast": "Edward Fox, Alan Badel, Tony Britton, Cyril Cusack, Derek Jacobi, Michael Lonsdale, Eric Porter, Delphine Seyrig",
  "ReleaseDate": "1973-06-15",
  "Color": "Color",
  "Image": "DayOfTheJackal",
  "Overview": "An international assassin known as ‘The Jackal’ is employed by disgruntled French generals to kill President Charles de Gaulle, with a dedicated gendarme on the assassin’s trail."
 },
 {
  "Movie": "De Dana Dan",
  "Language": "Hindi",
  "Genre": "Comedy",
  "Cast": "Akshay Kumar, Sunil Shetty, Katrina Kaif, Paresh Rawal, Sameera Reddy",
  "ReleaseDate": "2009-11-27",
  "Color": "Color",
  "Image": "DeDanaDan",
  "Overview": "Two down on their luck men tries to kidnap a wealthy businesswoman's dog to demand a hefty ransom from her. But things go haywire when the dog goes missing."
 },
 {
  "Movie": "Death on the Nile",
  "Language": "English",
  "Genre": "Drama",
  "Cast": "Tom Bateman, Annette Bening, Kenneth Branagh, Russell Brand, Ali Fazal, Dawn French",
  "ReleaseDate": "2022-02-11",
  "Color": "Color",
  "Image": "DeathOnTheNile",
  "Overview": "Belgian sleuth Hercule Poirot boards a glamorous river steamer with enough champagne to fill the Nile. But his Egyptian vacation turns into a thrilling search for a murderer when a picture-perfect couple’s idyllic honeymoon is tragically cut short."
 },
 {
  "Movie": "Deewane Huye Paagal",
  "Language": "Hindi",
  "Genre": "Comedy",
  "Cast": "Akshay Kumar, Suniel Shetty, Shahid Kapoor, Rimi Sen, Paresh Rawal, Johnny Lever",
  "ReleaseDate": "2005-11-25",
  "Color": "Color",
  "Image": "DeewaneHuyePaagal",
  "Overview": "A man embarks on journey to find his love in Dubai, only to learn she has different suitors and admirers."
 },
 {
  "Movie": "Despicable Me",
  "Language": "English",
  "Genre": "Animated",
  "Cast": "Steve Carell, Jason Segel, Russell Brand, Kristen Wiig, Miranda Cosgrove, Will Arnett, Danny McBride, Jack McBrayer, Julie Andrews",
  "ReleaseDate": "2010-08-06",
  "Color": "Color",
  "Image": "DespicableMe1",
  "Overview": "Villainous Gru lives up to his reputation as a despicable, deplorable and downright unlikable guy when he hatches a plan to steal the moon from the sky. But he has a tough time staying on task after three orphans land in his care."
 },
 {
  "Movie": "Despicable Me 2",
  "Language": "English",
  "Genre": "Animated",
  "Cast": "Steve Carell, Kristen Wiig, Benjamin Bratt, Miranda Cosgrove, Russell Brand, Ken Jeong",
  "ReleaseDate": "2013-07-05",
  "Color": "Color",
  "Image": "DespicableMe2",
  "Overview": "Gru is recruited by the Anti-Villain League to help deal with a powerful new super criminal."
 },
 {
  "Movie": "Despicable Me 3",
  "Language": "English",
  "Genre": "Animated",
  "Cast": "Steve Carell, Kristen Wiig, Trey Parker, Miranda Cosgrove, Steve Coogan, Jenny Slate, Dana Gaier, Julie Andrews",
  "ReleaseDate": "2017-06-30",
  "Color": "Color",
  "Image": "DespicableMe3",
  "Overview": "Gru meets his long-lost twin brother Dru, after getting fired from the Anti-Villain League. However, the siblings find themselves at loggerheads with a child actor-turned-villain."
 },
 {
  "Movie": "Devdas",
  "Language": "Hindi",
  "Genre": "Drama",
  "Cast": "Shah Rukh Khan, Aishwarya Rai, Madhuri Dixit",
  "ReleaseDate": "2002-07-12",
  "Color": "Color",
  "Image": "Devdas",
  "Overview": "After his wealthy family prohibits him from marrying the woman he is in love with, Devdas's life spirals downward as he takes up alcohol and a life of vice to alleviate the pain."
 },
 {
  "Movie": "Dictator, The",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "Sacha Baron Cohen, Anna Faris, Ben Kingsley",
  "ReleaseDate": "2012-05-16",
  "Color": "Color",
  "Image": "DictatorThe",
  "Overview": "The heroic story of a dictator who risks his life to ensure that democracy would never come to the country he so lovingly oppressed."
 },
 {
  "Movie": "Dil Chahta Hai",
  "Language": "Hindi",
  "Genre": "Romance",
  "Cast": "Aamir Khan, Saif Ali Khan, Akshaye Khanna, Preity Zinta, Sonali Kulkarni, Dimple Kapadia",
  "ReleaseDate": "2001-08-10",
  "Color": "Color",
  "Image": "DilChahtaHai",
  "Overview": "Three inseparable childhood friends are just out of college. Nothing comes between them - until they each fall in love, and their wildly different approaches to relationships creates tension."
 },
 {
  "Movie": "Dil To Pagal Hai",
  "Language": "Hindi",
  "Genre": "Romance",
  "Cast": "Shah Rukh Khan, Madhuri Dixit, Karisma Kapoor, Akshay Kumar",
  "ReleaseDate": "1997-10-30",
  "Color": "Color",
  "Image": "DilToPagalHai",
  "Overview": "Rahul, the director of a successful dance troupe, considers Nisha his best friend, though secretly, she is madly in love with him. He then falls for Pooja, who is engaged to Ajay."
 },
 {
  "Movie": "Dilwale Dulhania Le Jayenge",
  "Language": "Hindi",
  "Genre": "Romance",
  "Cast": "Shah Rukh Khan, Kajol",
  "ReleaseDate": "1995-10-20",
  "Color": "Color",
  "Image": "DilwaleDulhaniaLeJayenge",
  "Overview": "Raj is a rich, carefree, happy-go-lucky second generation NRI. Simran is the daughter of Chaudhary Baldev Singh, who in spite of being an NRI is very strict about adherence to Indian values. Simran has left for India to be married to her childhood fiancé. Raj leaves for India with a mission at his hands, to claim his lady love under the noses of her whole family. Thus begins a saga."
 },
 {
  "Movie": "Dirty Dozen, The",
  "Language": "English",
  "Genre": "Action",
  "Cast": "Lee Marvin, Ernest Borgnine, Charles Bronson, Jim Brown, John Cassavetes, Richard Jaeckel",
  "ReleaseDate": "1967-06-15",
  "Color": "Color",
  "Image": "DirtyDozen",
  "Overview": "Major Reisman is \"volunteered\" to lead another mission using convicted army soldiers, sentenced to either death or long prison terms. This time their mission is to kill a Nazi general who plans to assassinate Hitler."
 },
 {
  "Movie": "Don",
  "Language": "Hindi",
  "Genre": "Action",
  "Cast": "Shah Rukh Khan, Priyanka Chopra, Arjun Rampal, Isha Koppikar, Boman Irani, Pavan Malhotra, Rajesh Khattar, Om Puri, Kareena Kapoor",
  "ReleaseDate": "2006-10-20",
  "Color": "Color",
  "Image": "Don",
  "Overview": "DCP DeSilva sees a way to bring to justice the feared head of a criminal empire by recruiting a man named Vijay, who looks exactly like the crime boss. The ruse works too well, and soon Vijay finds his life in danger when DeSilva, the only one who knows his true identity, dies."
 },
 {
  "Movie": "Dunston Checks In",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "Jason Alexander, Faye Dunaway, Eric Lloyd, Rupert Everett, Glenn Shadix, Paul Reubens",
  "ReleaseDate": "1996-01-12",
  "Color": "Color",
  "Image": "DunstonChecksIn",
  "Overview": "Hotel manager Robert Grant is forced by his boss to postpone his family vacation when a hotel critic checks in. Trouble is, the critic is really a villainous jewel thief with an orangutan assistant named Dunston. When Dunston gets loose and tries to escape a life of crime -- aided by Robert's sons -- havoc, hijinks and lots of laughs abound!"
 },
 {
  "Movie": "Edge of Tomorrow",
  "Language": "English",
  "Genre": "Action",
  "Cast": "Tom Cruise, Emily Blunt, Bill Paxton, Brendan Gleeson",
  "ReleaseDate": "2014-06-06",
  "Color": "Color",
  "Image": "EdgeOfTomorrow",
  "Overview": "Major Bill Cage is an officer who has never seen a day of combat when he is unceremoniously demoted and dropped into combat. Cage is killed within minutes, managing to take an alpha alien down with him. He awakens back at the beginning of the same day and is forced to fight and die again... and again - as physical contact with the alien has thrown him into a time loop."
 },
 {
  "Movie": "Entrapment",
  "Language": "English",
  "Genre": "Action",
  "Cast": "Sean Connery, Catherine Zeta-Jones, Will Patton, Maury Chaykin, Ving Rhames",
  "ReleaseDate": "1999-04-30",
  "Color": "Color",
  "Image": "Entrapment",
  "Overview": "Two thieves, who travel in elegant circles, try to outsmart each other and, in the process, end up falling in love."
 },
 {
  "Movie": "Equalizer 1, The",
  "Language": "English",
  "Genre": "Action",
  "Cast": "Denzel Washington, Marton Csokas, Chloë Grace Moretz, David Harbour, Bill Pullman, Melissa Leo",
  "ReleaseDate": "2014-10-03",
  "Color": "Color",
  "Image": "Equalizer1",
  "Overview": "McCall believes he has put his mysterious past behind him and dedicated himself to beginning a new, quiet life. But when he meets Teri, a young girl under the control of ultra-violent Russian gangsters, he can’t stand idly by – he has to help her. Armed with hidden skills that allow him to serve vengeance against anyone who would brutalize the helpless, McCall comes out of his self-imposed retirement and finds his desire for justice reawakened. If someone has a problem, if the odds are stacked against them, if they have nowhere else to turn, McCall will help. He is The Equalizer."
 },
 {
  "Movie": "Equalizer 2, The",
  "Language": "English",
  "Genre": "Action",
  "Cast": "Denzel Washington, Pedro Pascal, Ashton Sanders, Bill Pullman, Melissa Leo",
  "ReleaseDate": "2018-07-20",
  "Color": "Color",
  "Image": "Equalizer2",
  "Overview": "Robert McCall, who serves an unflinching justice for the exploited and oppressed, embarks on a relentless, globe-trotting quest for vengeance when a long-time girl friend is murdered."
 },
 {
  "Movie": "ET",
  "Language": "English",
  "Genre": "Action",
  "Cast": "Dee Wallace, Henry Thomas, Peter Coyote, Robert MacNaughton, Drew Barrymore",
  "ReleaseDate": "1982-06-11",
  "Color": "Color",
  "Image": "ET",
  "Overview": "After a gentle alien becomes stranded on Earth, the being is discovered and befriended by a young boy named Elliott. Bringing the extraterrestrial into his suburban California house, Elliott introduces E.T., as the alien is dubbed, to his brother and his little sister, Gertie, and the children decide to keep its existence a secret. Soon, however, E.T. falls ill, resulting in government intervention and a dire situation for both Elliott and the alien."
 },
 {
  "Movie": "EuroTrip",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "Scott Mechlowicz, Jacob Pitts, Michelle Trachtenberg, Travis Wester",
  "ReleaseDate": "2004-02-20",
  "Color": "Color",
  "Image": "EuroTrip",
  "Overview": "When Scott learns that his longtime cyber-buddy from Berlin is a gorgeous young woman, he and his friends embark on a trip across Europe."
 },
 {
  "Movie": "Evan Almighty",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "Steve Carell, Morgan Freeman, Lauren Graham, John Goodman, John Michael Higgins, Jimmy Bennett, Wanda Sykes",
  "ReleaseDate": "2007-06-22",
  "Color": "Color",
  "Image": "EvanAlmighty",
  "Overview": "Junior congressman Evan Baxter, whose wish is to \"change the world\" is heard by none other than God. When God appears with the perplexing request to build an ark, Evan is sure he is losing it."
 },
 {
  "Movie": "Ferdinand",
  "Language": "English",
  "Genre": "Animated",
  "Cast": "John Cena, Kate McKinnon",
  "ReleaseDate": "2017-12-15",
  "Color": "Color",
  "Image": "Ferdinand",
  "Overview": "Ferdinand, a little bull, prefers sitting quietly under a cork tree just smelling the flowers versus jumping around, snorting, and butting heads with other bulls. As Ferdinand grows big and strong, his temperament remains mellow, but one day five men come to choose the \"biggest, fastest, roughest bull\" for the bullfights in Madrid and Ferdinand is mistakenly chosen. Based on the classic 1936 children's book by Munro Leaf."
 },
 {
  "Movie": "Fish Called Wanda, A",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "John Cleese, Jamie Lee Curtis, Kevin Kline, Michael Palin",
  "ReleaseDate": "1988-07-15",
  "Color": "Color",
  "Image": "FishCalledWanda",
  "Overview": "A diamond advocate is attempting to steal a collection of diamonds, yet troubles arise when he realizes that he is not the only one after the diamonds."
 },
 {
  "Movie": "Freaky Friday",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "Jamie Lee Curtis, Lindsay Lohan, Harold Gould, Chad Michael Murray, Mark Harmon",
  "ReleaseDate": "2003-08-06",
  "Color": "Color",
  "Image": "FreakyFriday",
  "Overview": "Mother and daughter bicker over everything -- what Anna wears, whom she likes and what she wants to do when she's older. In turn, Anna detests Tess's fiancé. When a magical fortune cookie switches their personalities, they each get a peek at how the other person feels, thinks and lives."
 },
 {
  "Movie": "French Kiss",
  "Language": "English",
  "Genre": "Romance",
  "Cast": "Meg Ryan, Kevin Kline, Timothy Hutton, Jean Reno, François Cluzet, Susan Anbeh",
  "ReleaseDate": "1995-05-05",
  "Color": "Color",
  "Image": "FrenchKiss",
  "Overview": "After her fiancee admits to infidelity while on a business trip in France, a woman attempts to get her lover back and marry him by traveling to Paris despite her crippling fear of flying. On the way she unwittingly smuggles something of value that has a charming crook chasing her across France as she chases after her future husband."
 },
 {
  "Movie": "Frozen",
  "Language": "English",
  "Genre": "Animated",
  "Cast": "Kristen Bell, Idina Menzel, Jonathan Groff, Josh Gad, Santino Fontana",
  "ReleaseDate": "2013-11-29",
  "Color": "Color",
  "Image": "Frozen",
  "Overview": "When their kingdom becomes trapped in perpetual winter, fearless Anna (Kristen Bell) joins forces with mountaineer Kristoff (Jonathan Groff) and his reindeer sidekick to find Anna's sister, Snow Queen Elsa (Idina Menzel), and break her icy spell. Although their epic journey leads them to encounters with mystical trolls, a comedic snowman (Josh Gad), harsh conditions, and magic at every turn, Anna and Kristoff bravely push onward in a race to save their kingdom from winter's cold grip."
 },
 {
  "Movie": "Fugitive, The",
  "Language": "English",
  "Genre": "Action",
  "Cast": "Harrison Ford, Tommy Lee Jones, Sela Ward, Joe Pantoliano, Andreas Katsulas, Jeroen Krabbé",
  "ReleaseDate": "1993-08-06",
  "Color": "Color",
  "Image": "Fugitive",
  "Overview": "Wrongfully convicted of murdering his wife and sentenced to death, Richard Kimble escapes from the law in an attempt to find the real killer and clear his name."
 },
 {
  "Movie": "Gandhi",
  "Language": "English",
  "Genre": "Drama",
  "Cast": "Ben Kingsley, Candice Bergen, Edward Fox, John Gielgud, Trevor Howard, John Mills, Martin Sheen",
  "ReleaseDate": "1982-11-30",
  "Color": "Color",
  "Image": "Gandhi",
  "Overview": "In the early years of the 20th century, Mohandas K. Gandhi, a British-trained lawyer, forsakes all worldly possessions to take up the cause of Indian independence. Faced with armed resistance from the British government, Gandhi adopts a policy of 'passive resistance', endeavouring to win freedom for his people without resorting to bloodshed."
 },
 {
  "Movie": "Ghost",
  "Language": "English",
  "Genre": "Drama",
  "Cast": "Patrick Swayze, Demi Moore, Whoopi Goldberg, Tony Goldwyn",
  "ReleaseDate": "1990-07-13",
  "Color": "Color",
  "Image": "Ghost",
  "Overview": "Sam Wheat is a banker, Molly Jensen is an artist, and the two are madly in love. However, when Sam is murdered by his friend and corrupt business partner Carl Bruner over a shady business deal, he is left to roam the earth as a powerless spirit. When he learns of Carl's betrayal, Sam must seek the help of psychic Oda Mae Brown to set things right and protect Molly from Carl and his goons."
 },
 {
  "Movie": "Ghost Town",
  "Language": "English",
  "Genre": "Drama",
  "Cast": "Ricky Gervais, Téa Leoni, Greg Kinnear, Billy Campbell, Kristen Wiig, Dana Ivey",
  "ReleaseDate": "2008-09-19",
  "Color": "Color",
  "Image": "GhostTown",
  "Overview": "Bertram Pincus, a cranky, people-hating Manhattan dentist, develops the unwelcome ability to see dead people. Really annoying dead people. Even worse, they all want something from him, particularly Frank Herlihy, a smooth-talking ghost, who pesters him into a romantic scheme involving his widow Gwen. They are soon entangled in a hilarious predicament between the now and the hereafter!"
 },
 {
  "Movie": "Gods Must Be Crazy",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "Nǃxau ǂToma, Sandra Prinsloo, Marius Weyers, Nic de Jager, Michael Thys, Louw Verwey, Ken Gampu, Simon Sabela",
  "ReleaseDate": "1980-09-10",
  "Color": "Color",
  "Image": "GodsMustBeCrazy",
  "Overview": "A Coca-Cola bottle dropped from an airplane raises havoc among a normally peaceful tribe of African bushmen who believe it to be a utensil of the gods."
 },
 {
  "Movie": "Gods Must Be Crazy 2",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "N!xau, Lena Farugia, Hans Strydom",
  "ReleaseDate": "1989-10-13",
  "Color": "Color",
  "Image": "GodsMustBeCrazy2",
  "Overview": "Xixo is back again. This time, his children accidentally stow away on a fast-moving poachers' truck, unable to get off, and Xixo sets out to rescue them. Along the way, he encounters a couple of soldiers trying to capture each other and a pilot and passenger of a small plane, who are each having a few problems of their own."
 },
 {
  "Movie": "Gol Maal",
  "Language": "Hindi",
  "Genre": "Comedy",
  "Cast": "Utpal Dutt, Amol Palekar, Bindiya Goswami",
  "ReleaseDate": "1979-04-20",
  "Color": "Color",
  "Image": "GolMaal",
  "Overview": "A man's simple lie to secure his job escalates into more complex lies when his orthodox boss becomes suspicious."
 },
 {
  "Movie": "Golden Eye",
  "Language": "English",
  "Genre": "Action",
  "Cast": "Pierce Brosnan, Sean Bean, Izabella Scorupco, Famke Janssen, Joe Don Baker",
  "ReleaseDate": "1997-08-23",
  "Color": "Color",
  "Image": "GoldenEye",
  "Overview": "When a powerful satellite system falls into the hands of Alec Trevelyan, AKA Agent 006, a former ally-turned-enemy, only James Bond can save the world from a dangerous space weapon that -- in one short pulse -- could destroy the earth! As Bond squares off against his former compatriot, he also battles Xenia Onatopp, an assassin who uses pleasure as her ultimate weapon"
 },
 {
  "Movie": "Guide",
  "Language": "Hindi",
  "Genre": "Drama",
  "Cast": "Dev Anand, Waheeda Rehman",
  "ReleaseDate": "1965-02-06",
  "Color": "Color",
  "Image": "Guide",
  "Overview": "When mistaken to be a sage by some villagers, an ex-tour guide reflects on his past and lost love to search for spiritual wisdom to guide the villagers."
 },
 {
  "Movie": "Guns of Navarone",
  "Language": "English",
  "Genre": "Action",
  "Cast": "Gregory Peck, David Niven, Anthony Quinn, Stanley Baker, Anthony Quayle, Irene Papas, Gia Scala, James Darren",
  "ReleaseDate": "1961-04-28",
  "Color": "Color",
  "Image": "GunsofNavarone",
  "Overview": "A team of allied saboteurs are assigned an impossible mission: infiltrate an impregnable Nazi-held island and destroy the two enormous long-range field guns that prevent the rescue of 2,000 trapped British soldiers."
 },
 {
  "Movie": "Guy Thing, A",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "Jason Lee, Julia Stiles, Selma Blair, James Brolin, Shawn Hatosy, Lochlyn Munro, Julie Hagerty",
  "ReleaseDate": "2003-01-17",
  "Color": "Color",
  "Image": "GuyThing",
  "Overview": "Paul Morse is a good guy. When his friends throw him a wild bachelor party, he just wants to keep his conscience clean -- which is why he's shocked when he wakes up in bed with a beautiful girl named Becky and can't remember the night before. Desperate to keep his fiancée, Karen, from finding out what may or may not be the truth, he tells her a teensy lie. Soon his lies are spiraling out of control and his life is a series of comical misunderstandings."
 },
 {
  "Movie": "Hangover 1, The",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "Bradley Cooper, Ed Helms, Zach Galifianakis, Heather Graham, Justin Bartha, Jeffrey Tambor",
  "ReleaseDate": "2009-06-26",
  "Color": "Color",
  "Image": "Hangover1",
  "Overview": "When three friends finally come to after a raucous night of bachelor-party revelry, they find a baby in the closet and a tiger in the bathroom. But they can't seem to locate their best friend, Doug – who's supposed to be tying the knot. Launching a frantic search for Doug, the trio perseveres through a nasty hangover to try to make it to the church on time."
 },
 {
  "Movie": "Hangover 2, The",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "Bradley Cooper, Ed Helms, Zach Galifianakis, Ken Jeong, Jeffrey Tambor, Justin Bartha, Paul Giamatti",
  "ReleaseDate": "2011-05-19",
  "Color": "Color",
  "Image": "Hangover2",
  "Overview": "The Hangover crew heads to Thailand for Stu's wedding. After the disaster of a bachelor party in Las Vegas last year, Stu is playing it safe with a mellow pre-wedding brunch. However, nothing goes as planned and Bangkok is the perfect setting for another adventure with the rowdy group."
 },
 {
  "Movie": "Hangover 3, The",
  "Language": "English",
  "Genre": "Comedy",
  "Cast": "Bradley Cooper, Ed Helms, Zach Galifianakis, Ken Jeong, Justin Bartha, Heather Graham, Jeffrey Tambor, John Goodman",
  "ReleaseDate": "2013-05-20",
  "Color": "Color",
  "Image": "Hangover3",
  "Overview": "This time, there's no wedding. No bachelor party. What could go wrong, right? But when the Wolfpack hits the road, all bets are off."
 },
 {
  "Movie": "Happy New Year",
  "Language": "Hindi",
  "Genre": "Drama",
  "Cast": "Deepika Padukone, Shah Rukh Khan, Abhishek Bachchan, Sonu Sood, Boman Irani, Vivaan Shah, Jackie Shroff",
  "ReleaseDate": "2014-10-24",
  "Color": "Color",
  "Image": "HappyNewYear",
  "Overview": "Six would-be thieves enter a prestigious dance competition as a cover for their larger goal of pulling off a major heist."
 },
 {
  "Movie": "Hera Pheri",
  "Language": "Hindi",
  "Genre": "Comedy",
  "ReleaseDate": "2000-03-31",
  "Color": "Color",
  "Image": "HeraPheri",
  "Overview": "Three unemployed men find the answer to all their money problems when they receive a call from a kidnapper. However, things do not go as planned."
 },
 {
  "Movie": "Hitch",
  "Language": "English",
  "Genre": "Romance",
  "ReleaseDate": "2005-03-18",
  "Color": "Color",
  "Image": "Hitch",
  "Overview": "Dating coach Alex 'Hitch' Hitchens mentors a bumbling client, Albert, who hopes to win the heart of the glamorous Allegra Cole. While Albert makes progress, Hitch faces his own romantic setbacks when proven techniques fail to work on Sara Melas, a tabloid reporter digging for dirt on Allegra Cole's love life. When Sara discovers Hitch's connection to Albert – now Allegra's boyfriend – it threatens to destroy both relationships."
 },
 {
  "Movie": "Holiday, The",
  "Language": "English",
  "Genre": "Romance",
  "ReleaseDate": "2006-11-29",
  "Color": "Color",
  "Image": "TheHoliday",
  "Overview": "Two women, one from the United States and one from the United Kingdom, swap homes at Christmas time after bad breakups with their boyfriends. Each woman finds romance with a local man but realizes that the imminent return home may end the relationship."
 },
 {
  "Movie": "Home Alone",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "1991-10-18",
  "Color": "Color",
  "Image": "HomeAlone",
  "Overview": "Eight-year-old Kevin McCallister makes the most of the situation after his family unwittingly leaves him behind when they go on Christmas vacation. But when a pair of bungling burglars set their sights on Kevin's house, the plucky kid stands ready to defend his territory. By planting booby traps galore, adorably mischievous Kevin stands his ground as his frantic mother attempts to race home before Christmas Day."
 },
 {
  "Movie": "Home Alone 2: Lost in New York",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "1992-11-15",
  "Color": "Color",
  "Image": "HomeAlone2",
  "Overview": "Instead of flying to Florida with his folks, Kevin ends up alone in New York, where he gets a hotel room with his dad's credit card—despite problems from a clerk and meddling bellboy. But when Kevin runs into his old nemeses, the Wet Bandits, he's determined to foil their plans to rob a toy store on Christmas Eve."
 },
 {
  "Movie": "Home Alone 3",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "1997-12-12",
  "Color": "Color",
  "Image": "HomeAlone3",
  "Overview": "9-year-old Alex Pruitt is home alone with the chicken pox. Turns out, due to a mix-up among nefarious spies, Alex was given a toy car concealing a top-secret microchip. Now Alex must fend off the spies as they try to break into his house to get it back."
 },
 {
  "Movie": "Home Alone 4",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "2002-11-03",
  "Color": "Color",
  "Image": "HomeAlone4",
  "Overview": "Kevin McCallister's parents have split up. Now living with his mom, he decides to spend Christmas with his dad at the mansion of his father's rich girlfriend, Natalie. Meanwhile robber Marv Merchants, one of the villains from the first two movies, partners up with a new criminal named Vera to hit Natalie's mansion"
 },
 {
  "Movie": "Hot Chick",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "2002-12-02",
  "Color": "Color",
  "Image": "HotChick",
  "Overview": "Not only is Jessica Spencer the most popular girl in school -- she is also the meanest. But things change for the attractive teen when a freak accident involving a cursed pair of earrings and a chance encounter at a gas station causes her to switch bodies with Clive, a sleazy crook. Jessica, in the form of the repulsive Clive, struggles to adjust to this radical alteration and sets out to get her own body back before the upcoming prom."
 },
 {
  "Movie": "Hot Pursuit",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "2015-05-08",
  "Color": "Color",
  "Image": "HotPursuit",
  "Overview": "An uptight by-the-book cop must protect the widow of a drug boss from crooked cops and gunmen."
 },
 {
  "Movie": "How to Lose a Guy in 10 Days",
  "Language": "English",
  "Genre": "Romance",
  "ReleaseDate": "2003-01-27",
  "Color": "Color",
  "Image": "HowToLoseAGuyIn10days",
  "Overview": "It’s the battle of wills, as Andie (Kate Hudson) needs to prove she can dump a guy in 10 days, whereas Ben (Matthew McConaughey) needs to prove he can win a girl in 10 days. Now, the clock is ticking - and the wildly entertaining comedy smash is off and running in this irresistible tale of sex, lies and outrageous romantic fireworks!"
 },
 {
  "Movie": "How to Train Your Dragon",
  "Language": "English",
  "Genre": "Animated",
  "ReleaseDate": "2010-04-16",
  "Color": "Color",
  "Image": "HowToTrainYourDragon",
  "Overview": "As the son of a Viking leader on the cusp of manhood, shy Hiccup Horrendous Haddock III faces a rite of passage: he must kill a dragon to prove his warrior mettle. But after downing a feared dragon, he realizes that he no longer wants to destroy it, and instead befriends the beast – which he names Toothless – much to the chagrin of his warrior father."
 },
 {
  "Movie": "Ice Age",
  "Language": "English",
  "Genre": "Animated",
  "ReleaseDate": "2002-05-03",
  "Color": "Color",
  "Image": "IceAge1",
  "Overview": "With the impending ice age almost upon them, a mismatched trio of prehistoric critters – Manny the woolly mammoth, Diego the saber-toothed tiger and Sid the giant sloth – find an orphaned infant and decide to return it to its human parents. Along the way, the unlikely allies become friends but, when enemies attack, their quest takes on far nobler aims."
 },
 {
  "Movie": "Independence Day",
  "Language": "English",
  "Genre": "Action",
  "ReleaseDate": "1996-07-03",
  "Color": "Color",
  "Image": "IndependenceDay",
  "Overview": "On July 2, a giant alien mothership enters orbit around Earth and deploys several dozen saucer-shaped 'destroyer' spacecraft that quickly lay waste to major cities around the planet. On July 3, the United States conducts a coordinated counterattack that fails. On July 4, a plan is devised to gain access to the interior of the alien mothership in space, in order to plant a nuclear missile."
 },
 {
  "Movie": "Indiana Jones Last Crusade",
  "Language": "English",
  "Genre": "Action",
  "ReleaseDate": "1989-05-24",
  "Color": "Color",
  "Image": "IndianaJonesLastCrusade",
  "Overview": "In 1938, an art collector appeals to eminent archaeologist Dr. Indiana Jones to embark on a search for the Holy Grail. Indy learns that a medieval historian has vanished while searching for it, and the missing man is his own father, Dr. Henry Jones Sr.. He sets out to rescue his father by following clues in the old man's notebook, which his father had mailed to him before he went missing. Indy arrives in Venice, where he enlists the help of a beautiful academic, Dr. Elsa Schneider, along with Marcus Brody and Sallah. Together they must stop the Nazis from recovering the power of eternal life and taking over the world!"
 },
 {
  "Movie": "Indiana Jones Temple Of Doom",
  "Language": "English",
  "Genre": "Action",
  "ReleaseDate": "1984-05-08",
  "Color": "Color",
  "Image": "IndianaJonesTempleOfDoom",
  "Overview": "After arriving in India, Indiana Jones is asked by a desperate village to find a mystical stone. He agrees – and stumbles upon a secret cult plotting a terrible plan in the catacombs of an ancient palace."
 },
 {
  "Movie": "Inside Man",
  "Language": "English",
  "Genre": "Action",
  "ReleaseDate": "2006-03-24",
  "Color": "Color",
  "Image": "InsideMan",
  "Overview": "When an armed, masked gang enter a Manhattan bank, lock the doors and take hostages, the detective assigned to effect their release enters negotiations preoccupied with corruption charges he is facing."
 },
 {
  "Movie": "Intern, The",
  "Language": "English",
  "Genre": "Drama",
  "ReleaseDate": "2015-09-25",
  "Color": "Color",
  "Image": "TheIntern",
  "Overview": "70-year-old widower Ben Whittaker has discovered that retirement isn't all it's cracked up to be. Seizing an opportunity to get back in the game, he becomes a senior intern at an online fashion site, founded and run by Jules Ostin."
 },
 {
  "Movie": "Invention of Lying, The",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "2009-09-14",
  "Color": "Color",
  "Image": "InventionOfLying",
  "Overview": "Set in a world where the concept of lying doesn't exist, a loser changes his lot when he invents lying and uses it to get ahead."
 },
 {
  "Movie": "It Happened One Night",
  "Language": "English",
  "Genre": "Romance",
  "ReleaseDate": "1934-02-23",
  "Color": "BW",
  "Image": "ItHappenedOneNight",
  "Overview": "A renegade reporter and a young heiress meet on a bus heading for New York, and end up stuck with each other when the bus leaves them behind at one of the stops."
 },
 {
  "Movie": "Italian Job",
  "Language": "English",
  "Genre": "Action",
  "ReleaseDate": "1969-06-02",
  "Color": "Color",
  "Image": "ItalianJob",
  "Overview": "Charlie's got a 'job' to do. Having just left prison he finds one his of friends has attempted a high risk job in Torino, Italy, right under the nose of the mafia. Charlie's friend doesn't get very far, so Charlie takes over the 'job'. Using three Mini Coopers, a couple of Jaguars and a bus, he hopes to bring Torino to a standstill, steal a fortune in gold and escape in the chaos."
 },
 {
  "Movie": "Italian Job - 2003, The",
  "Language": "English",
  "Genre": "Action",
  "ReleaseDate": "2003-05-30",
  "Color": "Color",
  "Image": "ItalianJob2",
  "Overview": "Charlie Croker pulled off the crime of a lifetime. The one thing that he didn't plan on was being double-crossed. Along with a drop-dead gorgeous safecracker, Croker and his team take off to re-steal the loot and end up in a pulse-pounding, pedal-to-the-metal chase that careens up, down, above and below the streets of Los Angeles."
 },
 {
  "Movie": "Jaane Bhi Do Yaaro",
  "Language": "Hindi",
  "Genre": "Comedy",
  "ReleaseDate": "1983-08-12",
  "Color": "Color",
  "Image": "JaaneBhiDoYaaro",
  "Overview": "Two photographers, who are employed by a newspaper editor to expose the scandalous activities of the rich, come across corruption by a builder and accidentally photograph a murder."
 },
 {
  "Movie": "Jab We Met",
  "Language": "Hindi",
  "Genre": "Romance",
  "ReleaseDate": "2007-10-26",
  "Color": "Color",
  "Image": "JabWeMet",
  "Overview": "A depressed wealthy businessman and a spunky and care-free young woman embark on an unexpected journey that changes their lives."
 },
 {
  "Movie": "Jason Bourne",
  "Language": "English",
  "Genre": "Action",
  "ReleaseDate": "2016-08-05",
  "Color": "Color",
  "Image": "JasonBourne",
  "Overview": "The most dangerous former operative of the CIA is drawn out of hiding to uncover hidden truths about his past."
 },
 {
  "Movie": "Jeans",
  "Language": "Tamil",
  "Genre": "Romance",
  "Cast": "Prashanth, Aishwarya Rai",
  "ReleaseDate": "1998-04-24",
  "Color": "Color",
  "Image": "Jeans",
  "Overview": "When Visu meets Madhumitha (Aishwarya Rai), they quickly fall in love and plan to marry. But the sweethearts hit a snag in their impending nuptials when Visu's father, Rajamani (Nasser), objects: Visu has a twin brother, Ramu, and the old man is set on both boys marrying twins. A solution is easily arrived at when Visu introduces his brother to his bride's twin sister -- who is actually Madhumitha in disguise. Mayhem ensues when Ramu unwittingly falls in love with his future sister-in-law."
 },
 {
  "Movie": "Johnny English",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "2003-04-06",
  "Color": "Color",
  "Image": "JohnnyEnglish",
  "Overview": "A lowly pencil pusher working for MI7, Johnny English is suddenly promoted to super spy after Agent One is assassinated and every other agent is blown up at his funeral. When a billionaire entrepreneur sponsors the exhibition of the Crown Jewels—and the valuable gems disappear on the opening night and on English's watch—the newly-designated agent must jump into action to find the thief and recover the missing gems."
 },
 {
  "Movie": "Johnny English Reborn",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "2011-09-23",
  "Color": "Color",
  "Image": "JohnnyEnglishReborn",
  "Overview": "The most prominent heads of state in the world begin gathering for a conference that could have a major impact on global politics. When MI-7 receives word that the Chinese premier has become the target of some high-powered killers, it falls on Johnny English to save the day. Armed with the latest high-tech weaponry and gadgets that would make even James Bond jealous, the once-disgraced agent uncovers evidence of a massive conspiracy involving some of the world's most powerful organisations, and vows to redeem his tarnished reputation by stopping the killers before they can strike."
 },
 {
  "Movie": "Jungle Book, The",
  "Language": "English",
  "Genre": "Animated",
  "ReleaseDate": "2016-04-08",
  "Color": "Color",
  "Image": "JungleBook",
  "Overview": "A man-cub named Mowgli fostered by wolves. After a threat from the tiger Shere Khan, Mowgli is forced to flee the jungle, by which he embarks on a journey of self discovery with the help of the panther, Bagheera and the free-spirited bear, Baloo."
 },
 {
  "Movie": "Junior",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "1994-11-23",
  "Color": "Color",
  "Image": "Junior",
  "Overview": "A research scientist becomes the world's first pregnant man in order to test a drug he and a colleague have designed for expectant women. To carry out the trial, he has an embryo implant, believing that he will only carry the baby for three months - hardly expecting to face the prospect of giving birth."
 },
 {
  "Movie": "Just Like Heaven",
  "Language": "English",
  "Genre": "Romance",
  "ReleaseDate": "2005-09-16",
  "Color": "Color",
  "Image": "JustLikeHeaven",
  "Overview": "Elizabeth Masterson, an emergency room physician in San Francisco whose work is everything, is in a car crash while on her way to a blind date at her sister's. Three months later, landscape architect David Abbott, needing a fresh start after his wife's death, takes a sublet on Elizabeth's apartment.\n<br> <br>Elizabeth begins to appear in the apartment, and both are confused. She thinks he is a squatter, and he thinks she broke in. They soon realize she moves through walls and objects. Elizabeth does not know who she is, and insists she is not dead. David unsuccessfully tries to have her spirit exorcised. As only David can see and hear her, others think he is hallucinating and talking to himself. Elizabeth asks him to help her discover who she really is."
 },
 {
  "Movie": "Kadhal Kottai",
  "Language": "Tamil",
  "Genre": "Romance",
  "Cast": "Ajith Kumar, Devayani, Heera Rasakopal, Karan, Thalaivasal Vijay, Manivannan",
  "ReleaseDate": "1996-07-12",
  "Color": "Color",
  "Image": "KadhalKottai",
  "Overview": "Kamali loses her bag in the railway station. Later, her bag is sent to her home, along with a letter from Surya, who found it. Kamali and Surya send letters to each other and soon fall in love."
 },
 {
  "Movie": "Kal Ho Naa Ho",
  "Language": "Hindi",
  "Genre": "Romance",
  "ReleaseDate": "2003-11-28",
  "Color": "Color",
  "Image": "KalHoNaaHo",
  "Overview": "An uptight MBA student falls for the charismatic new neighbor who charms her troubled family – but he has a secret that forces him to push her away."
 },
 {
  "Movie": "Kanna Laddu Thinna Aasaiya",
  "Language": "Tamil",
  "Genre": "Comedy",
  "ReleaseDate": "2013-01-13",
  "Color": "Color",
  "Image": "KannaLadduThinnaAasaiya",
  "Overview": "Shiva and his friends fall for Sowmya, who has just moved into their locality. They are forced into a competition to win over the girl."
 },
 {
  "Movie": "Kindergarten Cop",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "1990-12-21",
  "Color": "Color",
  "Image": "KindergartenCop",
  "Overview": "Hard-edged cop John Kimble gets more than he bargained for when he goes undercover as a kindergarten teacher to get the goods on a brutal drug lord while at the same time protecting the man's young son. Pitted against a class of boisterous moppets whose antics try his patience and test his mettle, Kimble may have met his match … in more ways than one."
 },
 {
  "Movie": "Knight and Day",
  "Language": "English",
  "Genre": "Action",
  "ReleaseDate": "2010-07-09",
  "Color": "Color",
  "Image": "KnightNDay",
  "Overview": "A fugitive couple goes on a glamorous and sometimes deadly adventure where nothing and no one – even themselves – are what they seem. Amid shifting alliances and unexpected betrayals, they race across the globe, with their survival ultimately hinging on the battle of truth vs. trust."
 },
 {
  "Movie": "Kuch Kuch Hota Hai",
  "Language": "Hindi",
  "Genre": "Romance",
  "ReleaseDate": "1998-10-16",
  "Color": "Color",
  "Image": "KuchKuchHotaHai",
  "Overview": "Per her mother's last wish, an 8 year old girl sets out to reunite her father with his college best friend who was in love with him."
 },
 {
  "Movie": "Kung Fu Panda 1",
  "Language": "English",
  "Genre": "Animated",
  "ReleaseDate": "2008-07-11",
  "Color": "Color",
  "Image": "KungFuPanda",
  "Overview": "When the Valley of Peace is threatened, lazy Po the panda discovers his destiny as the \"chosen one\" and trains to become a kung fu hero, but transforming the unsleek slacker into a brave warrior won't be easy. It's up to Master Shifu and the Furious Five -- Tigress, Crane, Mantis, Viper and Monkey -- to give it a try."
 },
 {
  "Movie": "Kung Fu Panda 2",
  "Language": "English",
  "Genre": "Animated",
  "ReleaseDate": "2011-05-26",
  "Color": "Color",
  "Image": "KungFuPanda2",
  "Overview": "Po is now living his dream as The Dragon Warrior, protecting the Valley of Peace alongside his friends and fellow kung fu masters, The Furious Five - Tigress, Crane, Mantis, Viper and Monkey. But Po’s new life of awesomeness is threatened by the emergence of a formidable villain, who plans to use a secret, unstoppable weapon to conquer China and destroy kung fu. It is up to Po and The Furious Five to journey across China to face this threat and vanquish it. But how can Po stop a weapon that can stop kung fu? He must look to his past and uncover the secrets of his mysterious origins; only then will he be able to unlock the strength he needs to succeed."
 },
 {
  "Movie": "Lagaan",
  "Language": "Hindi",
  "Genre": "Drama",
  "ReleaseDate": "2001-06-15",
  "Color": "Color",
  "Image": "Lagaan",
  "Overview": "In 1890s India, an arrogant British commander challenges the harshly taxed residents of Champaner to a high-stakes cricket match."
 },
 {
  "Movie": "Liar Liar",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "1997-03-18",
  "Color": "Color",
  "Image": "LiarLiar",
  "Overview": "Fletcher Reede is a fast-talking attorney and habitual liar. When his son Max blows out the candles on his fifth birthday he has just one wish - that his dad will stop lying for 24 hours. When Max's wish comes true, Fletcher discovers that his mouth has suddenly become his biggest liability."
 },
 {
  "Movie": "London",
  "Language": "Tamil",
  "Genre": "Comedy",
  "ReleaseDate": "2005-03-11",
  "Color": "Color",
  "Image": "London",
  "Overview": "Siva goes to London to work but ends up joining a gang led by Kathir. When they are deceived after a bank robbery, Siva is forced to hide in an aged couple's house posing as their grandson."
 },
 {
  "Movie": "Love Bug, The",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "1969-03-13",
  "Color": "Color",
  "Image": "LoveBug",
  "Overview": "Race car driver Jim Douglas (Dean Jones) and his philosophical mechanic, Tennessee Steinmetz (Buddy Hackett), find themselves in possession of a white Volkswagen Beetle that seems to have a mind and spirit of its own. Calling the car Herbie, Jim and Tennessee become the talk of the California racing circuit -- much to the displeasure of sports-car dealer Peter Thorndyke (David Tomlinson), who tries to use his assistant (Michele Lee) to come between the friends and their car."
 },
 {
  "Movie": "Madagascar",
  "Language": "English",
  "Genre": "Animated",
  "ReleaseDate": "2005-08-12",
  "Color": "Color",
  "Image": "Madagascar1",
  "Overview": "Alex the lion is the king of the urban jungle, the main attraction at New York's Central Park Zoo. He and his best friends—Marty the zebra, Melman the giraffe and Gloria the hippo—have spent their whole lives in blissful captivity before an admiring public and with regular meals provided for them. Not content to leave well enough alone, Marty lets his curiosity get the better of him and makes his escape—with the help of some prodigious penguins—to explore the world."
 },
 {
  "Movie": "Madagascar 3: Europe's Most Wanted",
  "Language": "English",
  "Genre": "Animated",
  "ReleaseDate": "2012-06-08",
  "Color": "Color",
  "Image": "Madagascar3",
  "Overview": "Animal pals Alex, Marty, Melman, and Gloria are still trying to make it back to New York's Central Park Zoo. They are forced to take a detour to Europe to find the penguins and chimps who broke the bank at a Monte Carlo casino. When French animal-control officer Capitaine Chantel DuBois picks up their scent, Alex and company are forced to hide out in a traveling circus."
 },
 {
  "Movie": "Madagascar: Escape 2 Africa",
  "Language": "English",
  "Genre": "Animated",
  "ReleaseDate": "2008-12-19",
  "Color": "Color",
  "Image": "Madagascar2",
  "Overview": "Alex, Marty, and other zoo animals find a way to escape from Madagascar when the penguins reassemble a wrecked airplane. The precariously repaired craft stays airborne just long enough to make it to the African continent. There the New Yorkers encounter members of their own species for the first time. Africa proves to be a wild place, but Alex and company wonder if it is better than their Central Park home."
 },
 {
  "Movie": "Madhumati ",
  "Language": "Hindi",
  "Genre": "Drama",
  "ReleaseDate": "1958-09-12",
  "Color": "BW",
  "Image": "Madhumati",
  "Overview": "Two men take shelter in a derelict mansion situated in the countryside during a storm. One of the men suddenly becomes aware that he once visited this mansion in a past life; he recounts a story about when he was Anand, a painter, who fell in love with a tribal girl named Madhumati."
 },
 {
  "Movie": "Maid In Manhattan",
  "Language": "English",
  "Genre": "Romance",
  "ReleaseDate": "2002-12-13",
  "Color": "Color",
  "Image": "MaidInManhattan",
  "Overview": "Marisa Ventura is a struggling single mom who works at a posh Manhattan hotel and dreams of a better life for her and her young son. One fateful day, hotel guest and senatorial candidate Christopher Marshall meets Marisa and mistakes her for a wealthy socialite. After an enchanting evening together, the two fall madly in love. But when Marisa's true identity is revealed, issues of class and social status threaten to separate them. Can two people from very different worlds overcome their differences and live happily ever after?"
 },
 {
  "Movie": "Malamaal Weekly",
  "Language": "Hindi",
  "Genre": "Comedy",
  "ReleaseDate": "2006-03-10",
  "Color": "Color",
  "Image": "MalamaalWeekly",
  "Overview": "Lilaram sells lottery tickets and one customer has hit the jackpot but dies of shock upon finding out that he has won. Now, Lilaram wants all the money, and so does everyone around him."
 },
 {
  "Movie": "Mamma Mia!",
  "Language": "English",
  "Genre": "Drama",
  "ReleaseDate": "2008-09-12",
  "Color": "Color",
  "Image": "MammaMia",
  "Overview": "An independent, single mother who owns a small hotel on a Greek island is about to marry off the spirited young daughter she's raised alone. But, the daughter has secretly invited three of her mother's ex-lovers in the hopes of finding her biological father."
 },
 {
  "Movie": "Margin Call",
  "Language": "English",
  "Genre": "Drama",
  "ReleaseDate": "2011-10-21",
  "Color": "Color",
  "Image": "MarginCall",
  "Overview": "A thriller that revolves around the key people at an investment bank over a 24-hour period during the early stages of the financial crisis."
 },
 {
  "Movie": "Mask",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "1994-07-28",
  "Color": "Color",
  "Image": "Mask",
  "Overview": "When timid bank clerk Stanley Ipkiss discovers a magical mask containing the spirit of the Norse god Loki, his entire life changes. While wearing the mask, Ipkiss becomes a supernatural playboy exuding charm and confidence which allows him to catch the eye of local nightclub singer Tina Carlyle. Unfortunately, under the mask's influence, Ipkiss also robs a bank, which angers junior crime lord Dorian Tyrell, whose goons get blamed for the heist."
 },
 {
  "Movie": "Mere Baap Pehle Aap",
  "Language": "Hindi",
  "Genre": "Comedy",
  "ReleaseDate": "2008-06-13",
  "Color": "Color",
  "Image": "MereBaapPehleAap",
  "Overview": "As if running a mall is not enough, Gaurav Rane has also to bail out his widower dad, Janardhan, as well as Madhav Mathur, several times from police custody on multiple counts of eve-teasing. Romance enters his life in the attractive shape of U.S.-based Sheekha Kapoor, who also befriends both Janardhan and Madhav. Chaos results, hilarious at times, when Janardhan starts to change his appearance to"
 },
 {
  "Movie": "Michael Madana Kama Rajan",
  "Language": "Tamil",
  "Genre": "Comedy",
  "ReleaseDate": "1990-10-17",
  "Color": "Color",
  "Image": "MichaelMadanaKamaRajan",
  "Overview": "A wicked man separates a set of quadruplets after their birth and one of them ends up with their biological father, while the other three find new homes. Things take a turn after they meet each other."
 },
 {
  "Movie": "Minions",
  "Language": "English",
  "Genre": "Animated",
  "ReleaseDate": "2015-07-10",
  "Color": "Color",
  "Image": "Minions",
  "Overview": "Minions Kevin, Stuart and Bob decide to find a new master. They embark on a global trip and meet Scarlett Overkill, a female super-villain who recruits them and hatches a plan to take over the world."
 },
 {
  "Movie": "Mohabbatein",
  "Language": "Hindi",
  "Genre": "Romance",
  "ReleaseDate": "2000-10-27",
  "Color": "Color",
  "Image": "Mohabbatein",
  "Overview": "At a prestigious all-male university, three friends seek love outside of the school grounds; at the same time, a newly-hired music teacher seeks to befriend and loosen up the militantly strict headmaster."
 },
 {
  "Movie": "Monster's Inc",
  "Language": "English",
  "Genre": "Animated",
  "ReleaseDate": "2001-11-02",
  "Color": "Color",
  "Image": "MonstersInc",
  "Overview": "James Sullivan and Mike Wazowski are monsters, they earn their living scaring children and are the best in the business... even though they're more afraid of the children than they are of them. When a child accidentally enters their world, James and Mike suddenly find that kids are not to be afraid of and they uncover a conspiracy that could threaten all children across the world."
 },
 {
  "Movie": "MonsterUniversity",
  "Language": "English",
  "Genre": "Animated",
  "ReleaseDate": "2013-06-21",
  "Color": "Color",
  "Image": "MonsterUniversity",
  "Overview": "A look at the relationship between Mike and Sulley during their days at Monsters University — when they weren't necessarily the best of friends."
 },
 {
  "Movie": "Monte Carlo",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "2011-07-01",
  "Color": "Color",
  "Image": "MonteCarlo",
  "Overview": "Three young women vacationing in Paris find themselves whisked away to Monte Carlo after one of the girls is mistaken for a British heiress."
 },
 {
  "Movie": "Mumbai Express",
  "Language": "Tamil",
  "Genre": "Comedy",
  "ReleaseDate": "2005-04-14",
  "Color": "Color",
  "Image": "MumbaiExpress",
  "Overview": "Three amateur thieves plot to kidnap the son of wealthy Mehta (Saurabh Shukla) from school. They do a trial run. However, on the eve of the kidnap, the guy whose job is to operate a crane in this plan is hospitalized. The services of Avinash a.k.a. Mumbai Xpress (Kamal Haasan), a deaf stunt man performing daredevil bike acts is roped in. Twists and turns take place where the other two gang members are hurt and invariably Mumbai Xpress is left to perform all the tasks by himself. He kidnaps the wrong boy, Daddu (Hardhik), the illegitimate son of Ahalya (Manisha Koirala) and police officer Rao (Om Puri), but manages to get a huge ransom from Mehta by default. A brawl takes place between the original kidnap planners - Digambar (Vijay Raaz), Johnson (Dinesh Lamba) and Avinash - in handling Ahalya's child but Avinash delivers the child unhurt to his mother. He secretly listen to Ahalya's tele-con with Rao where Rao wants to settle both the ransom and sever his ties with her. Ahalya pleads and coaxes him to help her get the ransom which Rao is willing to pay. The child takes a fancy to Avinash and wants him to be the man in their life, and gets him to agree. Ahalaya wants either Rao's or Mehta's money which Avinash is holding, whereas Avinash is in love and wants to be that protective person. Rao appoints Mehta to handle the ransom and what follows is a series of humorous mix-ups. In the end, all settle their differences and become the board of directors of Avinash's Mumbai Express, a mega bar owned by Avinash and Ahalya, now married, to a happy ending."
 },
 {
  "Movie": "Mungaru Male",
  "Language": "Tamil",
  "Genre": "Romance",
  "ReleaseDate": "2006-12-29",
  "Color": "Color",
  "Image": "MungaruMale",
  "Overview": "Preetham loves Nandhini but gets heartbroken when he comes to know that her marriage is already fixed. Things change when she challenges him to win her heart."
 },
 {
  "Movie": "Murder on the Orient Express",
  "Language": "English",
  "Genre": "Drama",
  "ReleaseDate": "2017-11-24",
  "Color": "Color",
  "Image": "MurderOnTheOrientExpress",
  "Overview": "Genius Belgian detective Hercule Poirot investigates the murder of an American tycoon aboard the Orient Express train."
 },
 {
  "Movie": "Nadigan",
  "Language": "Tamil",
  "Genre": "Comedy",
  "ReleaseDate": "1990-11-30",
  "Color": "Color",
  "Image": "Nadigan",
  "Overview": "Nadigan (English: Actor) is a 1990 Tamil film directed by P Vasu. The film stars Sathyaraj in the lead role pairing with Kushboo Sundar.[2] The film released with largely positive reviews and was declared a blockbuster. The film was a remake of Hindi film Professor"
 },
 {
  "Movie": "Nobody",
  "Language": "English",
  "Genre": "Action",
  "Cast": "Bob Odenkirk, Connie Nielsen, Michael Ironside, Christopher Lloyd",
  "ReleaseDate": "2021-03-26",
  "Color": "Color",
  "Image": "Nobody",
  "Overview": "Hutch Mansell, a seemingly mild-mannered family man and nobody, who becomes targeted by a group of dangerous criminals after an incident involving his family.<br><br>\nHutch's initial reluctance to defend himself and his family slowly gives way to a relentless pursuit of vengeance as he taps into his hidden skills and violent past. The movie unfolds with intense action sequences as Hutch faces off against ruthless adversaries, revealing his deadly capabilities and determination to protect his loved ones at any cost.<br><br>\nThe film explores themes of identity, redemption, and the consequences of underestimating someone who appears ordinary.<br><br>\n\"Nobody\" received positive reviews for its action choreography, Odenkirk's performance, and its darkly humorous take on the genre.<br><br>"
 },
 {
  "Movie": "Notting Hill",
  "Language": "English",
  "Genre": "Romance",
  "ReleaseDate": "1999-05-13",
  "Color": "Color",
  "Image": "NottingHill",
  "Overview": "William Thacker is a London bookstore owner whose humdrum existence is thrown into romantic turmoil when famous American actress Anna Scott appears in his shop. A chance encounter over spilled orange juice leads to a kiss that blossoms into a full-blown affair. As the average bloke and glamorous movie star draw closer and closer together, they struggle to reconcile their radically different lifestyles in the name of love."
 },
 {
  "Movie": "Octopussy",
  "Language": "English",
  "Genre": "Action",
  "ReleaseDate": "1983-06-06",
  "Color": "Color",
  "Image": "Octopussy",
  "Overview": "James Bond is sent to investigate after a fellow “00” agent is found dead with a priceless Indian Fabergé egg. Bond follows the mystery and uncovers a smuggling scandal and a Russian General who wants to provoke a new World War."
 },
 {
  "Movie": "Om Shanti Om",
  "Language": "Hindi",
  "Genre": "Drama",
  "ReleaseDate": "2007-11-09",
  "Color": "Color",
  "Image": "OmShantiOm",
  "Overview": "Reincarnated 30 years after being killed in a suspicious on-set fire, a small-time actor is determined to punish the person who ignited the blaze."
 },
 {
  "Movie": "Padington",
  "Language": "English",
  "Genre": "Animated",
  "ReleaseDate": "2014-11-23",
  "Color": "Color",
  "Image": "Padington",
  "Overview": "A young Peruvian bear travels to London in search of a new home. Finding himself lost and alone at Paddington Station, he meets the kindly Brown family."
 },
 {
  "Movie": "Padosan",
  "Language": "Hindi",
  "Genre": "Comedy",
  "ReleaseDate": "1968-11-29",
  "Color": "BW",
  "Image": "Padosan",
  "Overview": "Bhola falls in love with his neighbour Bindu, a fashionable college girl. In order to woo her, he seeks help from his musical friend but loses all hope when she shows interest in someone else."
 },
 {
  "Movie": "Pammal K. Sambandam",
  "Language": "Tamil",
  "Genre": "Comedy",
  "ReleaseDate": "2002-01-15",
  "Color": "Color",
  "Image": "PammalKSambandam",
  "Overview": "When Sambandham gets hurt, Dr Janaki performs a surgery in order to heal him. However, during the surgery, Janaki accidentally leaves her wrist watch in Sambandham's stomach."
 },
 {
  "Movie": "Panchathanthiram",
  "Language": "Tamil",
  "Genre": "Comedy",
  "ReleaseDate": "2002-06-28",
  "Color": "Color",
  "Image": "Panchathanthiram",
  "Overview": "Ram's friends hire Maggie, a call girl, to help him get over his wife, who mistakenly believes him to be a philanderer. However, they get in trouble when Maggie ends up dead."
 },
 {
  "Movie": "Pardes",
  "Language": "Hindi",
  "Genre": "Drama",
  "ReleaseDate": "1997-08-08",
  "Color": "Color",
  "Image": "Pardes",
  "Overview": "Kishorilal wants an Indian bride for his westernised son. He gets him engaged to Ganga, his friend's daughter, and brings her to USA. But she shares a deeper bond with Arjun, Kishorilal's foster son."
 },
 {
  "Movie": "Parent Trap, The",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "1998-07-20",
  "Color": "Color",
  "Image": "ParentTrap",
  "Overview": "Hallie Parker and Annie James are identical twins separated at a young age because of their parents' divorce. Unknowingly to their parents, the girls are sent to the same summer camp where they meet, discover the truth about themselves, and then plot with each other to switch places."
 },
 {
  "Movie": "Penguins of Madagascar",
  "Language": "English",
  "Genre": "Animated",
  "ReleaseDate": "2014-11-28",
  "Color": "Color",
  "Image": "PenguinsofMadagascar",
  "Overview": "Skipper, Kowalski, Rico and Private join forces with undercover organization The North Wind to stop the villainous Dr. Octavius Brine from destroying the world as we know it."
 },
 {
  "Movie": "Phir Hera Pheri",
  "Language": "Hindi",
  "Genre": "Comedy",
  "ReleaseDate": "2006-06-09",
  "Color": "Color",
  "Image": "PhirHeraPheri",
  "Overview": "Babu Rao, Raju and Shyam, are living happily after having risen from rags to riches. Still, money brings the joy of riches and with it the greed to make more money - and so, with a don as an unknowing investor, Raju initiates a new game."
 },
 {
  "Movie": "Pink Panther 2, The",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "2009-01-24",
  "Color": "Color",
  "Image": "PinkPanther2",
  "Overview": "When legendary treasures from around the world are stolen, including the priceless Pink Panther Diamond, Chief Inspector Dreyfus is forced to assign Inspector Clouseau to a team of international detectives and experts charged with catching the thief and retrieving the stolen artifacts."
 },
 {
  "Movie": "Pink Panther, The",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "2006-02-10",
  "Color": "Color",
  "Image": "PinkPanther1",
  "Overview": "When the coach of the France soccer team is killed by a poisoned dart in the stadium in the end of a game, and his expensive and huge ring with the diamond Pink Panther disappears, the ambitious Chief Inspector Dreyfus assigns the worst police inspector Jacques Clouseau to the case."
 },
 {
  "Movie": "Pretty Woman",
  "Language": "English",
  "Genre": "Romance",
  "ReleaseDate": "1990-03-23",
  "Color": "Color",
  "Image": "PrettyWoman",
  "Overview": "When a millionaire wheeler-dealer enters a business contract with a Hollywood hooker Vivian Ward, he loses his heart in the bargain."
 },
 {
  "Movie": "Qayamat Se Qayamat Tak",
  "Language": "Hindi",
  "Genre": "Drama",
  "Cast": "Aamir Khan, Juhi Chawla, Goga Kapoor",
  "ReleaseDate": "1988-04-29",
  "Color": "Color",
  "Image": "QSQT",
  "Overview": "Despite knowing that their respective families are bitter enemies, Raj and Rashmi fall in love with each other and decide to elope."
 },
 {
  "Movie": "Rab Ne Bana Di Jodi",
  "Language": "Hindi",
  "Genre": "Romance",
  "ReleaseDate": "2008-12-12",
  "Color": "Color",
  "Image": "RabNeBanaDiJodi",
  "Overview": "A lonely 40-ish man, likely to remain a bachelor, has a chance to find the love of his life when he falls for a vivacious young woman. Have you ever stopped to think if the most ordinary, uninteresting, unobtrusive man you might see on the road or around you might have a love story to tell? Maybe not. How can an ordinary man have a breathtaking, goose flesh igniting, awe inspiring love story of all things to tell? <br>This is what happened to Surinder Sahni (Shahrukh Khan) - a simple, clean hearted, honest man, leading a humdrum life, when he meets his total opposite and finds love in the flamboyant, fun-loving, vivacious - Taani (Anushka Sharma) for whom the whole world is her canvas and she paints her own life with the colours of rainbow all until unforeseen circumstances changes it all and brings them together. What follows is a journey filled with laughter, tears, joy, pain, music, dance and a lot of love. A journey that makes us believe that there is an extraordinary love story in every ordinary jodi (couple)."
 },
 {
  "Movie": "Rangeela",
  "Language": "Hindi",
  "Genre": "Drama",
  "ReleaseDate": "1995-09-08",
  "Color": "Color",
  "Image": "Rangeela",
  "Overview": "Mili's ambition of becoming a famous actor is met with several hurdles when Raj Kamal, a noted actor, and Munna, her childhood friend, both fall in love with her."
 },
 {
  "Movie": "Ratatouille",
  "Language": "English",
  "Genre": "Animated",
  "ReleaseDate": "2007-06-29",
  "Color": "Color",
  "Image": "Ratatouille",
  "Overview": "Remy, a resident of Paris, appreciates good food and has quite a sophisticated palate. He would love to become a chef so he can create and enjoy culinary masterpieces to his heart's delight. The only problem is, Remy is a rat. When he winds up in the sewer beneath one of Paris' finest restaurants, the rodent gourmet finds himself ideally placed to realize his dream."
 },
 {
  "Movie": "Return of the Pink Panther, The",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "1975-05-21",
  "Color": "Color",
  "Image": "ReturnOfThePinkPanther",
  "Overview": "The famous Pink Panther jewel has once again been stolen and Inspector Clouseau is called in to catch the thief. The Inspector is convinced that 'The Phantom' has returned and utilises all of his resources – himself and his Asian manservant – to reveal the identity of 'The Phantom'."
 },
 {
  "Movie": "Rio",
  "Language": "English",
  "Genre": "Animated",
  "ReleaseDate": "2011-04-15",
  "Color": "Color",
  "Image": "Rio",
  "Overview": "Captured by smugglers when he was just a hatchling, a macaw named Blu (Lorànt Deutsch) never learned to fly but has a happy domesticated life in Minnesota with Linda (Élisabeth Ventura), who thinks he is the last of his breed."
 },
 {
  "Movie": "Roman Holiday",
  "Language": "English",
  "Genre": "Romance",
  "Cast": "Gregory Peck, Audrey Hepburn",
  "ReleaseDate": "1953-08-20",
  "Color": "BW",
  "Image": "RomanHoliday",
  "Overview": "Overwhelmed by her suffocating schedule, touring European princess Ann takes off for a night while in Rome. When a sedative she took from her doctor kicks in, however, she falls asleep on a park bench and is found by an American reporter, Joe Bradley, who takes her back to his apartment for safety. At work the next morning, Joe finds out Ann's regal identity and bets his editor he can get exclusive interview with her, but romance soon gets in the way."
 },
 {
  "Movie": "Romancing The Stone",
  "Language": "English",
  "Genre": "Romance",
  "ReleaseDate": "1984-03-24",
  "Color": "Color",
  "Image": "RomancingTheStone",
  "Overview": "Though she can spin wild tales of passionate romance, novelist Joan Wilder has no life of her own. Then one day adventure comes her way in the form of a mysterious package. It turns out that the parcel is the ransom she'll need to free her abducted sister, so Joan flies to South America to hand it over. But she gets on the wrong bus and winds up hopelessly stranded in the jungle."
 },
 {
  "Movie": "Royal Matchmaker",
  "Language": "English",
  "Genre": "Romance",
  "ReleaseDate": "2018-03-24",
  "Color": "Color",
  "Image": "RoyalMatchmaker",
  "Overview": "A struggling NYC matchmaker is hired by a king to find his son a suitable wife in time for a national celebration. As the clock ticks towards her deadline, the matchmaker finds him the perfect wife -- only to realize that she’s fallen in love with him!"
 },
 {
  "Movie": "Sholay",
  "Language": "Hindi",
  "Genre": "Action",
  "ReleaseDate": "1975-08-15",
  "Color": "Color",
  "Image": "Sholay",
  "Overview": "After his family is murdered by a notorious and ruthless bandit, a former police officer enlists the services of two outlaws to capture the bandit."
 },
 {
  "Movie": "Shot in the Dark, A",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "1965-01-29",
  "Color": "Color",
  "Image": "ShotInTheDarkA",
  "Overview": "Inspector Jacques Clouseau investigates the murder of Mr. Benjamin Ballon's driver at a country estate."
 },
 {
  "Movie": "Sister Act",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "1992-05-29",
  "Color": "Color",
  "Image": "SisterAct",
  "Overview": "A Reno singer witnesses a mob murder and the cops stash her in a nunnery to protect her from the mob's hitmen. The mother superior does not trust her, and takes steps to limit her influence on the other nuns. Eventually the singer rescues the failing choir and begins helping with community projects, which gets her an interview on TV—and identification by the mob."
 },
 {
  "Movie": "Six Days Seven Nights",
  "Language": "English",
  "Genre": "Action",
  "ReleaseDate": "1998-06-12",
  "Color": "Color",
  "Image": "SixDaysSevenNights",
  "Overview": "When Quinn, a grouchy pilot living the good life in the South Pacific, agrees to transfer a savvy fashion editor, Robin, to Tahiti, he ends up stranded on a deserted island with her after their plane crashes. The pair avoid each other at first, until they're forced to team up to escape from the island -- and some pirates who want their heads."
 },
 {
  "Movie": "Sound of Music, The",
  "Language": "English",
  "Genre": "Drama",
  "ReleaseDate": "1965-03-02",
  "Color": "Color",
  "Image": "SoundOfMusic",
  "Overview": "In the years before the Second World War, a tomboyish postulant at an Austrian abbey is hired as a governess in the home of a widowed naval captain with seven children, and brings a new love of life and music into the home."
 },
 {
  "Movie": "Spider-Man 1",
  "Language": "English",
  "Genre": "Action",
  "ReleaseDate": "2002-05-03",
  "Color": "Color",
  "Image": "Spiderman1",
  "Overview": "After being bitten by a genetically altered spider at Oscorp, nerdy but endearing high school student Peter Parker is endowed with amazing powers to become the superhero known as Spider-Man."
 },
 {
  "Movie": "Spider-Man 2",
  "Language": "English",
  "Genre": "Action",
  "ReleaseDate": "2004-06-30",
  "Color": "Color",
  "Image": "Spiderman2",
  "Overview": "Peter Parker is going through a major identity crisis. Burned out from being Spider-Man, he decides to shelve his superhero alter ego, which leaves the city suffering in the wake of carnage left by the evil Doc Ock. In the meantime, Parker still can't act on his feelings for Mary Jane Watson, a girl he's loved since childhood. A certain anger begins to brew in his best friend Harry Osborn as well..."
 },
 {
  "Movie": "Sudden Death",
  "Language": "English",
  "Genre": "Action",
  "ReleaseDate": "1995-12-22",
  "Color": "Color",
  "Image": "SuddenDeath",
  "Overview": "When a man's daughter is suddenly taken during a championship hockey game – with the captors demanding a billion dollars by game's end – he frantically sets a plan in motion to rescue her and abort an impending explosion before the final buzzer."
 },
 {
  "Movie": "Swades",
  "Language": "Hindi",
  "Genre": "Drama",
  "ReleaseDate": "2004-12-17",
  "Color": "Color",
  "Image": "Swades",
  "Overview": "A successful Indian scientist returns to an Indian village to take his nanny to America with him and in the process rediscovers his roots."
 },
 {
  "Movie": "Terminator 1, The",
  "Language": "English",
  "Genre": "Action",
  "ReleaseDate": "1984-10-26",
  "Color": "Color",
  "Image": "Terminator1",
  "Overview": "In the post-apocalyptic future, reigning tyrannical supercomputers teleport a cyborg assassin known as the \"Terminator\" back to 1984 to kill Sarah Connor, whose unborn son is destined to lead insurgents against 21st century mechanical hegemony. Meanwhile, the human-resistance movement dispatches a lone warrior to safeguard Sarah. Can he stop the virtually indestructible killing machine?"
 },
 {
  "Movie": "Terminator 2: Judgment Day",
  "Language": "English",
  "Genre": "Action",
  "ReleaseDate": "1991-08-24",
  "Color": "Color",
  "Image": "Terminator2",
  "Overview": "Nearly 10 years have passed since Sarah Connor was targeted for termination by a cyborg from the future. Now her son, John, the future leader of the resistance, is the target for a newer, more deadly terminator. Once again, the resistance has managed to send a protector back to attempt to save John and his mother Sarah."
 },
 {
  "Movie": "Terminator 3: Rise of the Machines",
  "Language": "English",
  "Genre": "Action",
  "ReleaseDate": "2003-07-25",
  "Color": "Color",
  "Image": "Terminator3",
  "Overview": "It's been 10 years since John Connor saved Earth from Judgment Day, and he's now living under the radar, steering clear of using anything Skynet can trace. That is, until he encounters T-X, a robotic assassin ordered to finish what T-1000 started. Good thing Connor's former nemesis, the Terminator, is back to aid the now-adult Connor … just like he promised."
 },
 {
  "Movie": "The Brain",
  "Language": "English",
  "Genre": "Drama",
  "ReleaseDate": "1969-03-07",
  "Color": "Color",
  "Image": "TheBrain",
  "Overview": "The mastermind (David Niven) of Britain's great train robbery plans to rob a French train of NATO money bound for Brussels."
 },
 {
  "Movie": "Thenali",
  "Language": "Tamil",
  "Genre": "Comedy",
  "ReleaseDate": "2000-10-27",
  "Color": "Color",
  "Image": "Thenali",
  "Overview": "Thenali suffers from panophobia and seeks doctor Kailash's help but the latter denies his request. Later, when Kailash goes on a vacation with his family, Thenali joins them and charms his sister."
 },
 {
  "Movie": "Thillu Mullu",
  "Language": "Tamil",
  "Genre": "Comedy",
  "ReleaseDate": "1981-05-01",
  "Color": "Color",
  "Image": "ThilluMullu",
  "Overview": "Chandran lies to his boss that his mother is unwell to get a leave but gets caught. In order to save his job, he is forced to pretend to his boss that he has a good-for-nothing twin brother."
 },
 {
  "Movie": "Three To Tango",
  "Language": "English",
  "Genre": "Romance",
  "ReleaseDate": "1999-10-19",
  "Color": "Color",
  "Image": "ThreeToTango",
  "Overview": "Oscar and Peter land a career-making opportunity when a Chicago tycoon chooses them to compete for the design of a cultural center. The tycoon mistakenly believes that Oscar is gay and has him spy on his mistress Amy. Oscar goes along with it and ends up falling in love with Amy."
 },
 {
  "Movie": "To Sir With Love",
  "Language": "English",
  "Genre": "Drama",
  "ReleaseDate": "1967-10-29",
  "Color": "Color",
  "Image": "ToSirWithLove",
  "Overview": "A British Guianese engineer starts a job as a high school teacher in London’s East End, where his uninterested and delinquent pupils are in desperate need of attention and care."
 },
 {
  "Movie": "Tom and Jerry",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "2021-02-26",
  "Color": "Color",
  "Image": "TomJerry",
  "Overview": "Tom the cat and Jerry the mouse get kicked out of their home and relocate to a fancy New York hotel, where a scrappy employee named Kayla will lose her job if she can’t evict Jerry before a high-class wedding at the hotel. Her solution? Hiring Tom to get rid of the pesky mouse."
 },
 {
  "Movie": "Tomorrow Never Dies",
  "Language": "English",
  "Genre": "Action",
  "ReleaseDate": "1997-12-09",
  "Color": "Color",
  "Image": "TomorrowNeverDies",
  "Overview": "A deranged media mogul is staging international incidents to pit the world's superpowers against each other. Now James Bond must take on this evil mastermind in an adrenaline-charged battle to end his reign of terror and prevent global pandemonium."
 },
 {
  "Movie": "Tourist, The",
  "Language": "English",
  "Genre": "Action",
  "ReleaseDate": "2010-12-06",
  "Color": "Color",
  "Image": "TheTourist",
  "Overview": "It stars Angelina Jolie as Elise Clifton-Ward, a mysterious and elegant British woman who crosses paths with an American math teacher, Frank Tupelo, played by Johnny Depp, while traveling to Venice, Italy.<br \/><br \/>\nThe story begins when Elise, under surveillance by Scotland Yard and other law enforcement agencies, receives instructions to find a man of similar build to her lover, Alexander Pearce, in order to mislead those pursuing him. Frank, an unsuspecting tourist, becomes entangled in this web of intrigue when Elise deliberately chooses him as her decoy. What follows is a series of twists and turns as Frank finds himself caught up in a dangerous game of deception and betrayal.<br \/><br \/>\nAs Frank and Elise navigate the beautiful and perilous streets of Venice, their relationship evolves amidst the backdrop of international espionage and suspense. The film blends elements of romance, suspense, and mystery as the characters' true motives and allegiances are gradually revealed.<br \/><br \/>\n"
 },
 {
  "Movie": "Tower Heist",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "2011-11-04",
  "Color": "Color",
  "Image": "TowerHeist",
  "Overview": "A luxury condo manager leads a staff of workers to seek payback on the Wall Street swindler who defrauded them. With only days until the billionaire gets away with the perfect crime, the unlikely crew of amateur thieves enlists the help of petty crook Slide to steal the $20 million they’re sure is hidden in the penthouse."
 },
 {
  "Movie": "Trading Places",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "1986-05-13",
  "Color": "Color",
  "Image": "TradingPlaces",
  "Overview": "A snobbish investor and a wily street con-artist find their positions reversed as part of a bet by two callous millionaires."
 },
 {
  "Movie": "Truman Show, The",
  "Language": "English",
  "Genre": "Drama",
  "ReleaseDate": "1998-06-05",
  "Color": "Color",
  "Image": "TrumanShow",
  "Overview": "Truman Burbank is the star of The Truman Show, a 24-hour-a-day reality TV show that broadcasts every aspect of his life without his knowledge. His entire life has been an unending soap opera for consumption by the rest of the world. And everyone he knows, including his wife and his best friend is really an actor, paid to be part of his life."
 },
 {
  "Movie": "Ullathai Allitha",
  "Language": "Tamil",
  "Genre": "Comedy",
  "Cast": "Karthik, Rambha, Goundamani",
  "ReleaseDate": "1996-01-05",
  "Color": "Color",
  "Image": "UllathaiAllitha",
  "Overview": "Tired of his father's disciplinarian ways and to avoid marrying a girl chosen by the latter, Raja runs away to Ooty. There, he is hired as a driver by the man whose daughter he was supposed to marry."
 },
 {
  "Movie": "Unnaipol Oruvan",
  "Language": "Tamil",
  "Genre": "Drama",
  "ReleaseDate": "2009-09-11",
  "Color": "Color",
  "Image": "UnnaipolOruvan",
  "Overview": "A common man tries to fight terrorism by making anonymous calls to cops. Will he succeed ?"
 },
 {
  "Movie": "Up",
  "Language": "English",
  "Genre": "Animated",
  "ReleaseDate": "1998-11-06",
  "Color": "Color",
  "Image": "Up",
  "Overview": "Carl Fredricksen spent his entire life dreaming of exploring the globe and experiencing life to its fullest. But at age 78, life seems to have passed him by, until a twist of fate (and a persistent 8-year old Wilderness Explorer named Russell) gives him a new lease on life."
 },
 {
  "Movie": "Waterboy, The",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "2008-09-05",
  "Color": "Color",
  "Image": "Waterboy",
  "Overview": "Bobby Boucher is a water boy for a struggling college football team. The coach discovers Boucher's hidden rage makes him a tackling machine whose bone-crushing power might vault his team into the playoffs."
 },
 {
  "Movie": "Wednesday, A",
  "Language": "Hindi",
  "Genre": "Drama",
  "ReleaseDate": "2007-12-21",
  "Color": "Color",
  "Image": "Wednesday",
  "Overview": "A retired police commissioner recounts the most memorable case of his career, wherein he was informed about a bomb scare in Mumbai."
 },
 {
  "Movie": "Welcome",
  "Language": "Hindi",
  "Genre": "Comedy",
  "ReleaseDate": "2013-08-30",
  "Color": "Color",
  "Image": "Welcome",
  "Overview": "Dubai-based criminal don Uday takes it upon himself to try and get his sister Sanjana married - in vain, as no one wants to be associated with a crime family. Uday's associate Sagar Pandey finds a young man, Rajiv, who lives with his maternal uncle and aunt - Dr. and Mrs. Ghunghroo. Through extortion he compels Ghunghroo to accept this matrimonial alliance. But Rajiv has already fallen in love with young woman in South Africa. When the time comes to get Rajiv formally engaged to this woman, he finds out that Sanjana and she are the very same. With no escape from this predicament, the wedding is planned, with hilarious consequences."
 },
 {
  "Movie": "We're the Millers",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "2001-05-18",
  "Color": "Color",
  "Image": "WereTheMillers",
  "Overview": "A veteran pot dealer creates a fake family as part of his plan to move a huge shipment of weed into the U.S. from Mexico."
 },
 {
  "Movie": "What Women Want",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "2004-06-23",
  "Color": "Color",
  "Image": "WhatWomenWant",
  "Overview": "Advertising executive Nick Marshall is as cocky as they come, but what happens to a chauvinistic guy when he can suddenly hear what women are thinking? Nick gets passed over for a promotion, but after an accident enables him to hear women's thoughts, he puts his newfound talent to work against Darcy, his new boss, who seems to be infatuated with him."
 },
 {
  "Movie": "White Chicks",
  "Language": "English",
  "Genre": "Comedy",
  "ReleaseDate": "1999-11-08",
  "Color": "Color",
  "Image": "WhiteChicks",
  "Overview": "Two FBI agent brothers, Marcus and Kevin Copeland, accidentally foil a drug bust. To avoid being fired they accept a mission escorting a pair of socialites to the Hamptons--but when the girls are disfigured in a car accident, they refuse to go. Left without options, Marcus and Kevin decide to pose as the sisters, transforming themselves from black men into rich white women."
 },
 {
  "Movie": "World Is Not Enough, The",
  "Language": "English",
  "Genre": "Action",
  "ReleaseDate": "1999-11-08",
  "Color": "Color",
  "Image": "WorldIsNotEnough",
  "Overview": "Greed, revenge, world dominance and high-tech terrorism – it's all in a day's work for Bond, who's on a mission to protect a beautiful oil heiress from a notorious terrorist. In a race against time that culminates in a dramatic submarine showdown, Bond works to defuse the international power struggle that has the world's oil supply hanging in the balance."
 },
 {
  "Movie": "You've Got Mail",
  "Language": "English",
  "Genre": "Romance",
  "ReleaseDate": "1988-02-19",
  "Color": "Color",
  "Image": "YouveGotMail",
  "Overview": "Book superstore magnate, Joe Fox and independent book shop owner, Kathleen Kelly fall in love in the anonymity of the Internet—both blissfully unaware that he's trying to put her out of business."
 },
 {
  "Movie": "Zootopia",
  "Language": "English",
  "Genre": "Animated",
  "ReleaseDate": "2009-09-18",
  "Color": "Color",
  "Image": "Zootopia",
  "Overview": "Determined to prove herself, Officer Judy Hopps, the first bunny on Zootopia's police force, jumps at the chance to crack her first case - even if it means partnering with scam-artist fox Nick Wilde to solve the mystery."
 }
]